[
  {
    "name": "Kafka",
    "path": "Nihility",
    "imagePath": "lib/images/kafka.png",
    "element": "Lighting",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Midnight Tumult\nSingle Target\nDeals Lightning DMG equal to 50% of Kafka's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Kafka_Normal.png",
    "skill": "Caressing Moonlight\nBlast\nDeals Lightning DMG equal to 80% of Kafka's ATK to a target enemy and Lightning DMG equal to 30% of Kafka's ATK to enemies adjacent to it.\nIf the target enemy is currently receiving DoT, all DoTs currently placed on that enemy immediately produce DMG equal to 60% of their original DMG.",
    "skillImage": "lib/images/skills/SkillIcon_Kafka_BP.png",
    "ultimate": "Twilight Trill\nAoE ATK\nDeals Lightning DMG equal to 48% of Kafka's ATK to all enemies, with a 100% base chance for enemies hit to become Shocked and immediately take DMG equal to 80% of the DoT. Shock lasts for 2 turn(s).\nWhile Shocked, enemies receive Lightning DoT equal to 116% of Kafka's ATK at the beginning of each turn.",
    "ultimateImage": "lib/images/skills/SkillIcon_Kafka_Ultra.png",
    "Technique": "Mercy Is Not Forgiveness\nImmediately attacks all enemies within a set range. After entering battle, deals Lightning DMG equal to 50% of Kafka's ATK to all enemies, with a 100% base chance to inflict Shock equivalent to that applied by her Ultimate on every enemy target for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_Kafka_Maze.png",
    "Talent": "Gentle but Cruel\nSingle Target\nAfter an ally of Kafka's uses Basic ATK on an enemy target, Kafka immediately launches 1 follow-up attack and deals Lightning DMG equal to 42% of her ATK to that target, with a 100% base chance to inflict Shock equivalent to that applied by her Ultimate to the attacked enemy target for 2 turns. This effect can only be triggered 1 time per turn.",
    "TalentImage": "lib/images/skills/SkillIcon_Kafka_Passive.png",
    "eidolon1": "Da Capo\nWhen the Talent triggers a follow-up attack, there is a 100% base chance to increase the DoT received by the target by 30% for 2 turn(s).",
    "eidolon1Image": "lib/images/edions/Kafka_Rank_1.png",
    "eidolon2": "Fortississimo\nWhile Kafka is on the field, DoT dealt by all allies increases by 25%.",
    "eidolon2Image": "lib/images/edions/Kafka_Rank_2.png",
    "eidolon3": "Capriccio\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Kafka_Rank_3.png",
    "eidolon4": "Recitativo\nWhen an enemy target takes DMG from the Shock status inflicted by Kafka, Kafka additionally regenerates 2 Energy.",
    "eidolon4Image": "lib/images/edions/Kafka_Rank_4.png",
    "eidolon5": "Doloroso\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Kafka_Rank_5.png",
    "eidolon6": "Leggiero\nThe DMG multiplier for Shock DMG dealt by Ultimate, Technique, or the follow-up attack triggered by Talent increases by 156%, and extends the duration of Shock on the enemy target by 1 turn(s).",
    "eidolon6Image": "lib/images/edions/Kafka_Rank_6.png",
    "ascension2": "Torture\nWhen the Ultimate is used, enemy targets will now receive DMG immediately from all currently applied DoT sources instead of just receiving DMG immediately from the currently applied Shock state.",
    "ascension2Image": "lib/images/skills/SkillIcon_Kafka_Rank1.png",
    "ascension4": "Plunder\nIf an enemy is defeated while Shocked, Kafka additionally regenerates 5 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_Kafka_Rank2.png",
    "ascension6": "Thorns\nThe base chance for Ultimate, Technique, or the follow-up attack triggered by the Talent to inflict Shock increases by 30%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Kafka_Ultra_on.png"
  },
  {
    "name": "Black Swan",
    "path": "Nihility",
    "imagePath": "lib/images/blackswan.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Percipience, Silent Dawn\nSingle Target\nDeals Wind DMG equal to 30% of Black Swan's ATK to a single target enemy, with a 50% base chance of inflicting 1 stack of Arcana. And if the hit target currently has Wind Shear, Bleed, Burn, or Shock applied to them, each respectively has a 50% base chance of inflicting 1 extra stack of Arcana onto the enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Black Swan_Normal.png",
    "skill": "Decadence, False Twilight\nBlast\nDeals Wind DMG equal to 45% of Black Swan's ATK to a single target enemy and any adjacent targets. At the same time, there is a 100% base chance of inflicting 1 stack of Arcana on the target enemy and the adjacent targets. And there is a 100% base chance of reducing the DEF of the target enemy and the adjacent targets by 14.8%, lasting for 3 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_Black Swan_BP.png",
    "ultimate": "Bliss of Otherworld's Embrace\nAoE ATK\nInflicts Epiphany on all enemies for 2 turn(s).\nEnemies affected by Epiphany take 15% more DMG in their turn, and their Arcana effect is regarded as Wind Shear, Bleed, Burn, and Shock effects. In addition, when their Arcana effect is triggered at the beginning of the next turn, the Arcana stacks are not reset. The stack non-reset effect can be triggered up to 1 time(s) in Epiphany's duration, and its charges are replenished when Epiphany is applied again.\nDeals Wind DMG equal to 72% of Black Swan's ATK to all enemies.",
    "ultimateImage": "lib/images/skills/SkillIcon_BattleEventBlack Swan_Ultra.png",
    "Technique": "From Façade to Vérité\nEnhance\nAfter this Technique is used, there is a 150% base chance for each enemy to be inflicted with 1 stack of Arcana at the start of the next battle. For each successful application of Arcana on a target, inflicts another stack of Arcana on the same target. This process repeats until Arcana fails to be inflicted on this target. For each successive application of Arcana on a target, its base chance of success is equal to 50% of the base chance of the previous successful infliction of Arcana on that target.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Black Swan_Maze.png",
    "Talent": "Loom of Fate's Caprice\nImpair\nEvery time an enemy target receives DoT at the start of each turn, there is a 50% base chance for it to be inflicted with Arcana.\nWhile afflicted with Arcana, enemy targets receive Wind DoT equal to 96% of Black Swan's ATK at the start of each turn. Each stack of Arcana increases this DoT DMG multiplier by 4.8%. Then Arcana resets to 1 stack. Arcana can stack up to 50 times.\nOnly when Arcana causes DMG at the start of an enemy target's turn, Black Swan triggers additional effects based on the number of Arcana stacks inflicted on the target:\nWhen there are 3 or more Arcana stacks, deals Wind DoT equal to 72% of Black Swan's ATK to adjacent targets, with a 50% base chance of inflicting 1 stack of Arcana on adjacent targets.\nWhen there are 7 or more Arcana stacks, enables the current DoT dealt this time to ignore 20% of the target's and adjacent targets' DEF.",
    "TalentImage": "lib/images/skills/SkillIcon_Black Swan_Passive.png",
    "eidolon1": "Seven Pillars of Wisdom\nWhile Black Swan is active in battle, enemies afflicted with Wind Shear, Bleed, Burn, or Shock will have their corresponding Wind, Physical, Fire, or Lightning RES respectively reduced by 25%.",
    "eidolon1Image": "lib/images/Black Swan_Rank_1.png",
    "eidolon2": "Weep Not For Me, My Lamb\nWhen an enemy target afflicted with Arcana is defeated, there is a 100% base chance of inflicting 6 stack(s) of Arcana on adjacent targets.",
    "eidolon2Image": "lib/images/Black Swan_Rank_2.png",
    "eidolon3": "As Above, So Below\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/Black Swan_Rank_3.png",
    "eidolon4": "In Tears We Gift\nWhile in the Epiphany state, enemy targets have their Effect RES reduced by 10%. And at the start of their turn or when they get defeated, Black Swan regenerates 8 Energy. This Energy Regeneration effect can only trigger up to 1 time while Epiphany lasts. And this trigger count resets after the enemy gets inflicted with Epiphany again.",
    "eidolon4Image": "lib/images/Black Swan_Rank_4.png",
    "eidolon5": "Linnutee Flyway\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/Black Swan_Rank_5.png",
    "eidolon6": "Pantheon Merciful, Masses Pitiful\nWhen enemy targets get attacked by Black Swan's allies, Black Swan has a 65% base chance of inflicting 1 stack of Arcana on the target.\nEach time Black Swan inflicts Arcana on an enemy target, there is a 50% fixed chance to additionally increase the number of Arcana stacks afflicted this time by 1.",
    "eidolon6Image": "lib/images/Black Swan_Rank_6.png",
    "ascension2": "Viscera's Disquiet\nAfter using the Skill to hit an enemy that has Wind Shear, Bleed, Burn, or Shock, each of these debuffs respectively has a 65% base chance of inflicting 1 extra stack of Arcana.",
    "ascension2Image": "lib/images/skills/SkillIcon_Black Swan_SkillTree1.png",
    "ascension4": "Goblet's Dredges\nThere is a 65% base chance to inflict 1 stack of Arcana when a target enters battle. Every time an enemy target receives DoT during a single attack by an ally, there is a 65% base chance for the target to be inflicted with 1 stack of Arcana, stacking up to 3 time(s) during 1 single attack.",
    "ascension4Image": "lib/images/skills/SkillIcon_Black Swan_SkillTree2.png",
    "ascension6": "Candleflame's Portent\nIncreases this unit's DMG by an amount equal to 60% of Effect Hit Rate, up to a maximum DMG increase of 72%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Black Swan_SkillTree3.png"
  },
  {
    "name": "Ruan Mei",
    "path": "Harmony",
    "imagePath": "lib/images/ruanmei.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Threading Fragrance\nSingle Target\nDeals Ice DMG equal to 50% of Ruan Mei's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Ruan Mei_Normal.png",
    "skill": "String Sings Slow Swirls\nSupport\nAfter using her Skill, Ruan Mei gains Overtone, lasting for 3 turn(s). This duration decreases by 1 at the start of Ruan Mei's turn. When Ruan Mei has Overtone, all allies' DMG increases by 16% and Weakness Break Efficiency increases by 50%.",
    "skillImage": "lib/images/skills/SkillIcon_Ruan Mei_BP.png",
    "ultimate": "Petals to Stream, Repose in Dream\nSupport\nRuan Mei deploys a field that lasts for 2 turns. The field's duration decreases by 1 at the start of her turn.\nWhile inside the field, all allies' All-Type RES PEN increases by 15% and their attacks apply Thanatoplum Rebloom to the enemies hit.\nWhen these enemies attempt to recover from Weakness Break, Thanatoplum Rebloom is triggered, extending the duration of their Weakness Break, delaying their action by an amount equal to 20% of Ruan Mei's Break Effect plus 10%, and dealing Break DMG equal to 30% of Ruan Mei's Ice Break DMG.\nEnemy targets cannot have Thanatoplum Rebloom re-applied to them until they recover from Weakness Break.\n\n",
    "ultimateImage": "lib/images/skills/SkillIcon_Ruan Mei_Ultra.png",
    "Technique": "Silken Serenade\nEnhance\nAfter using the Technique, gains Silken Serenade. At the start of the next battle, automatically triggers the Skill for 1 time(s) without consuming Skill Points.\nIn Simulated Universe, when Ruan Mei has Silken Serenade, the team actively attacking enemies will always be regarded as attacking their Weakness to enter battle, and this attack can reduce all enemies' Toughness regardless of Weakness types. When breaking Weakness, triggers Weakness Break Effect corresponding to the attacker's Type. For every Blessing in possession up to 20 Blessing(s), additionally increases the Toughness-Reducing DMG of this attack by 100%. After breaking an enemy target's Weakness, additionally deals to the enemy target Break DMG equal to 100% of Ruan Mei's Ice Break DMG.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Ruan Mei_Maze.png",
    "Talent": "Somatotypical Helix\nSupport\nIncreases SPD by 8% for the team (excluding this character). When allies Break an enemy target's Weakness, Ruan Mei deals to this enemy target Break DMG equal to 60% of her Ice Break DMG.",
    "TalentImage": "lib/images/skills/SkillIcon_Ruan Mei_Passive.png",
    "eidolon1": "Neuronic Embroidery\nWhile the Ultimate's field is deployed, the DMG dealt by all allies ignores 20% of the target's DEF.",
    "eidolon1Image": "lib/images/edions/Ruan Mei_Rank_1.png",
    "eidolon2": "Reedside Promenade\nWith Ruan Mei on the field, all allies increase their ATK by 40% when dealing DMG to enemies with Weakness Break.",
    "eidolon2Image": "lib/images/edions/Ruan Mei_Rank_2.png",
    "eidolon3": "Viridescent Pirouette\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Ruan Mei_Rank_3.png",
    "eidolon4": "Chatoyant Éclat\nWhen an enemy target's Weakness is Broken, Ruan Mei's Break Effect increases by 100% for 3 turn(s).",
    "eidolon4Image": "lib/images/edions/Ruan Mei_Rank_4.png",
    "eidolon5": "Languid Barrette\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Ruan Mei_Rank_5.png",
    "eidolon6": "Sash Cascade\nExtends the duration of the Ultimate's field by 1 turn(s). The Talent's Break DMG multiplier additionally increases by 200%.",
    "eidolon6Image": "lib/images/edions/Ruan Mei_Rank_6.png",
    "ascension2": "Inert Respiration\nIncreases Break Effect by 20% for all allies.",
    "ascension2Image": "lib/images/skills/SkillIcon_Ruan Mei_SkillTree1.png",
    "ascension4": "Days Wane, Thoughts Wax\nRuan Mei regenerates 5 Energy at the start of her turn.",
    "ascension4Image": "lib/images/skills/SkillIcon_Ruan Mei_SkillTree2.png",
    "ascension6": "Candle Lights on Still Waters\nIn battle, for every 10% of Ruan Mei's Break Effect that exceeds 120%, her Skill additionally increases allies' DMG by 6%, up to a maximum of 36%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Ruan Mei_SkillTree3.png"
  },
  {
    "name": "Acheron",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Acheron.png",
    "element": "Lightning",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Trilateral Wiltcross\nSingle Target\nDeals Lightning DMG equal to 50% of Acheron's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_3017_Normal.png",
    "skill": "Octobolt Flash\nBlast\nGains 1 point(s) of Slashed Dream. Inflicts 1 stack(s) of Crimson Knot on a single target enemy, dealing Lightning DMG equal to 80% of Acheron's ATK to this target, as well as Lightning DMG equal to 30% of Acheron's ATK to adjacent targets.",
    "skillImage": "lib/images/skills/SkillIcon_3017_BP.png",
    "ultimate": "Slashed Dream Cries in Red\nAoE\nSequentially unleash Rainblade 3 times and Stygian Resurge 1 time, dealing Lightning DMG up to 223.2% of Acheron's ATK to a single target enemy, as well as Lightning DMG up to 180% of Acheron's ATK to other targets. Rainblade: Deals Lightning DMG equal to 14.4% of Acheron's ATK to a single target enemy and removes up to 3 stacks of Crimson Knot from the target. When Crimson Knot is removed, immediately deals Lightning DMG equal to 9% of Acheron's ATK to all enemies. For every stack of Crimson Knot removed, this DMG Multiplier is additionally increased, up to a maximum of 36%. Stygian Resurge: Deals Lightning DMG equal to 72% of Acheron's ATK to all enemies and remove all Crimson Knots. Crimson Knot cannot be applied to enemies during the Ultimate.",
    "ultimateImage": "lib/images/skills/SkillIcon_3017_Ultra_on.png",
    "Technique": "Quadrivalent Ascendance\nBreak\nImmediately attacks the enemy. At the start of each wave, gains Quadrivalent Ascendance, dealing Lightning DMG equal to 200% of Acheron's ATK to all enemies and reducing Toughness of all enemies irrespective of Weakness Types. When Weakness is broken, triggers the Lightning Weakness Break effect. Quadrivalent Ascendance: After using the Ultimate, Acheron gains 1 point(s) of Slashed Dream and inflicts 1 stack(s) of Crimson Knot on a single random enemy. If attacking a normal enemy, immediately defeats them without entering combat. When not hitting enemies, no Technique Points are consumed.",
    "TechniqueImage": "lib/images/skills/SkillIcon_3017_Maze.png",
    "Talent": "Atop Rainleaf Hangs Oneness\nEnhance\nWhen Slashed Dream reaches 9 point(s), the Ultimate can be activated. During the Ultimate, reduces enemies' Toughness regardless of Weakness Types and reduces all enemies' All-Type RES by 10%, lasting until the end of the Ultimate. When any unit inflicts debuffs on an enemy target while using their ability, Acheron gains 1 point of Slashed Dream and inflicts 1 stack of Crimson Knot on the target. If debuffs are inflicted on multiple targets, then the 1 stack of Crimson Knot will be inflicted on the enemy target with the most Crimson Knot stacks. This effect can only trigger once per every ability usage. After an enemy target exits the field or gets defeated by any unit while Acheron is on the field, their Crimson Knot stacks will be transferred to the enemy target with the most Crimson Knot stacks on the whole field.",
    "TalentImage": "lib/images/skills/SkillIcon_3017_Passive.png",
    "eidolon1": "Silenced Sky Spake Sooth\nCRIT Rate increases by 18% when dealing DMG to debuffed enemies.",
    "eidolon1Image": "lib/images/edions/Acheron_1.png",
    "eidolon2": "Mute Thunder in Still Tempest\nThe number of Nihility characters required for the Trace \"The Abyss\" to achieve its highest possible effect is reduced by 1. When this unit's turn starts, gains 1 point of Slashed Dream and inflicts 1 stack of Crimson Knot on the enemy with the most Crimson Knot stacks.",
    "eidolon2Image": "lib/images/edions/Acheron_2.png",
    "eidolon3": "Frost Bites in Death\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Acheron_3.png",
    "eidolon4": "Shrined Fire for Mirrored Soul\nWhen enemy targets enter combat, afflict them with the Ultimate DMG Vulnerable Vulnerability state, increasing the amount of Ultimate DMG they take by 8%.",
    "eidolon4Image": "lib/images/edions/Acheron_4.png",
    "eidolon5": "Strewn Souls on Erased Earths\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15",
    "eidolon5Image": "lib/images/edions/Acheron_5.png",
    "eidolon6": "Apocalypse, the Emancipator\nIncreases the All-Type RES PEN for the Ultimate DMG dealt by Acheron by 20%. The DMG dealt by Basic ATK and Skill will also be considered as Ultimate DMG and can reduce enemy toughness regardless of Weakness Types. When Weakness is broken, triggers the Lightning Weakness Break effect.",
    "eidolon6Image": "lib/images/edions/Acheron_6.png",
    "ascension2": "Red Oni\nWhen battle starts, immediately gains 5 point(s) of Slashed Dream and applies 5 stack(s) of Crimson Knot to a random enemy. When Slashed Dream reaches its upper limit, for every point of Slashed Dream that exceeds the limit, gains 1 stack of Quadrivalent Ascendance. Increases the maximum stackable count for Quadrivalent Ascendance to 3.",
    "ascension2Image": "lib/images/skills/SkillIcon_3017_Rank1.png",
    "ascension4": "The Abyss\nWhen there are 1 or 2 Nihility characters other than Acheron in the team, the DMG dealt by Acheron's Basic ATK, Skill, and Ultimate increases to 115% or 160% of the original DMG respectively.",
    "ascension4Image": "lib/images/skills/SkillIcon_3017_Rank2.png",
    "ascension6": "Thunder Core\nWhen the Rainblade from Acheron's Ultimate hits enemy targets with Crimson Knot, her DMG increases by 30%, stacking up to 3 time(s) and lasting for 3 turn(s). And when Stygian Resurge triggers, additionally deals DMG for 6 times. Each time deals Lightning DMG equal to 25% of Acheron's ATK to a single random enemy and is viewed as part of the Ultimate DMG",
    "ascension6Image": "lib/images/skills/SkillIcon_3017_Ultra.png"
  },
  {
    "name": "Argenti",
    "path": "Erudition",
    "imagePath": "lib/images/characters/Argenti.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/era.png",
    "basic": "Fleeting Fragrance\nSingle Target\nDeals Physical DMG equal to 50% of Argenti's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Argenti_Normal.png",
    "skill": "Justice, Hereby Blooms\nAoE ATK\nDeals Physical DMG equal to 60% of Argenti's ATK to all enemies.",
    "skillImage": "lib/images/skills/SkillIcon_Argenti_BP.png",
    "ultimate": "For In This Garden Supreme Beauty Bestows\nAoE ATK\nConsumes 90 Energy and deals Physical DMG equal to 96% of Argenti's ATK to all enemies.\n\nMerit Bestowed in \"My\" Garden\nConsumes 180 Energy and deals Physical DMG equal to 168% of Argenti's ATK to all enemies. And further deals DMG for 6 extra time(s), with each time dealing Physical DMG equal to 57% of Argenti's ATK to a random enemy.",
    "ultimateImage": "lib/images/skills/SkillIcon_8003_Ultra_on.png",
    "Technique": "Manifesto of Purest Virtue\nImpair\nAfter using the Technique, enemies in a set area are inflicted with Daze for 10 second(s). Dazed enemies will not actively attack the team.\nWhen attacking a Dazed enemy to enter combat, deals Physical DMG to all enemies equal to 80% of Argenti's ATK and regenerates his Energy by 15.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Argenti_Maze.png",
    "Talent": "Sublime Object\nEnhance\nFor every enemy hit when Argenti uses his Basic Attack, Skill, or Ultimate, regenerates Argenti's Energy by 3, and grants him a stack of Apotheosis, increasing his CRIT Rate by 1%. This effect can stack up to 10 time(s).",
    "TalentImage": "lib/images/skills/SkillIcon_Argenti_Passive.png",
    "eidolon1": "A Lacuna in Kingdom of Aesthetics\nEach stack of Apotheosis additionally increases CRIT DMG by 4%.",
    "eidolon1Image": "lib/images/Argenti_Rank_1.png",
    "eidolon2": "Agate's Humility\nIf the number of enemies on the field equals to 3 or more when the Ultimate is used, ATK increases by 40% for 1 turn(s).",
    "eidolon2Image": "lib/images/Argenti_Rank_2.png",
    "eidolon3": "Thorny Road's Glory\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/Argenti_Rank_3.png",
    "eidolon4": "Trumpet's Dedication\nAt the start of battle, gains 2 stack(s) of Apotheosis and increases the maximum stack limit of the Talent's effect by 2.",
    "eidolon4Image": "lib/images/Argenti_Rank_4.png",
    "eidolon5": "Snow, From Somewhere in Cosmos\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/Argenti_Rank_5.png",
    "eidolon6": "Your Resplendence\nWhen using Ultimate, ignores 30% of enemy targets' DEF.",
    "eidolon6Image": "lib/images/Argenti_Rank_6.png",
    "ascension2": "Piety\nAt the start of a turn, immediately gains 1 stack(s) of Apotheosis.",
    "ascension2Image": "lib/images/skills/SkillIcon_Argenti_SkillTree1.png",
    "ascension4": "Generosity\nWhen enemy targets enter battle, immediately regenerates 2 Energy for self.",
    "ascension4Image": "lib/images/skills/SkillIcon_Argenti_SkillTree2.png",
    "ascension6": "Courage\nDeals 15% more DMG to enemies whose HP percentage is 50% or less.",
    "ascension6Image": "lib/images/skills/SkillIcon_Argenti_SkillTree3.png"
  },
  {
    "name": "Arlan",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Arlan.png",
    "element": "Lightning",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Lightning Rush\nSingle Target\nDeals Lightning DMG equal to 50% of Arlan's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Arlan_Normal.png",
    "skill": "Shackle Breaker\nSingle Target\nConsumes Arlan's HP equal to 15% of his Max HP to deal Lightning DMG equal to 120% of Arlan's ATK to a single enemy. If Arlan does not have sufficient HP, his HP will be reduced to 1 after using his Skill.",
    "skillImage": "lib/images/skills/SkillIcon_Arlan_BP.png",
    "ultimate": "Frenzied Punishment\nBlast\nDeals Lightning DMG equal to 192% of Arlan's ATK to a single enemy and Lightning DMG equal to 96% of Arlan's ATK to enemies adjacent to it.",
    "ultimateImage": "lib/images/skills/SkillIcon_Asta_Ultra_on.png",
    "Technique": "Swift Harvest\nImmediately attacks the enemy. After entering battle, deals Lightning DMG equal to 80% of Arlan's ATK to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Arlan_Maze.png",
    "Talent": "Pain and Anger\nEnhance\nIncreases Arlan's DMG for every percent of HP below his Max HP, up to a max of 36% more DMG.",
    "TalentImage": "lib/images/skills/SkillIcon_Arlan_Passive.png",
    "eidolon1": "To the Bitter End\nWhen HP is lower than or equal to 50% of Max HP, increases Skill's DMG by 10%.",
    "eidolon1Image": "lib/images/Arlan_Rank_1.png",
    "eidolon2": "Breaking Free\nUsing Skill or Ultimate removes 1 debuff from oneself.",
    "eidolon2Image": "lib/images/Arlan_Rank_2.png",
    "eidolon3": "Power Through\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/Arlan_Rank_3.png",
    "eidolon4": "Turn the Tables\nWhen struck by a killing blow after entering battle, instead of becoming knocked down, Arlan immediately restores his HP to 25% of his Max HP.\nThis effect is automatically removed after it is triggered once or after 2 turn(s) have elapsed.",
    "eidolon4Image": "lib/images/Arlan_Rank_4.png",
    "eidolon5": "Hammer and Tongs\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15",
    "eidolon5Image": "lib/images/Arlan_Rank_5.png",
    "eidolon6": "Self-Sacrifice\nWhen HP drops to 50% or below, Ultimate deals 20% more DMG.\nThe DMG multiplier of DMG taken by the target enemy now applies to adjacent enemies as well.",
    "eidolon6Image": "lib/images/Arlan_Rank_6.png",
    "ascension2": "Revival\nIf the current HP percentage is 30% or lower when defeating an enemy, immediately restores HP equal to 20% of Max HP.",
    "ascension2Image": "lib/images/skills/SkillIcon_Asta_Rank1.png",
    "ascension4": "Perseverance\nThe chance to resist DoT Debuffs increases by 50%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Asta_Rank2.png",
    "ascension6": "Repel\nUpon entering battle, if Arlan's HP is less than or equal to 50%, he can nullify all DMG received except for DoT until after he is attacked.",
    "ascension6Image": "lib/images/skills/SkillIcon_Asta_Ultra.png"
  },
  {
    "name": "Asta",
    "path": "Harmony",
    "imagePath": "lib/images/characters/Asta.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Spectrum Beam\nSingle Target\nDeals Fire DMG equal to 50% of Asta's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Asta_Normal.png",
    "skill": "Meteor Storm\nBounce\nDeals Fire DMG equal to 25% of Asta's ATK to a single enemy and further deals DMG for 4 extra times, with each time dealing Fire DMG equal to 25% of Asta's ATK to a random enemy.",
    "skillImage": "lib/images/skills/SkillIcon_Asta_BP.png",
    "ultimate": "Astral Blessing\nSupport\nIncreases SPD of all allies by 36 for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_Asta_Ultra_on.png",
    "Technique": "Miracle Flash\nImmediately attacks the enemy.\nAfter entering battle, deals Fire DMG equal to 50% of Asta's ATK to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Asta_Maze.png",
    "Talent": "Astrometry\nSupport\nGains 1 atack of Charging for every different enemy hit by Asta plus an extra stack if the enemy hit has Fire Weakness.\nFor every stack of Charging Asta has, all allies' ATK increases by 7.0%, up to 5 time(s).\nStarting from her second turn, Asta's Charging stack count is reduced by 3 at the beginning of every turn.",
    "TalentImage": "lib/images/skills/SkillIcon_Asta_Passive.png",
    "eidolon1": "Star Sings Sans Verses or Vocals\nWhen using Skill, deals DMG for 1 extra time to a random enemy.",
    "eidolon1Image": "lib/images/Asta_Rank_1.png",
    "eidolon2": "Moon Speaks in Wax and Wane\nAfter using her Ultimate, Asta's Charging stacks will not be reduced in the next turn.",
    "eidolon2Image": "lib/images/Asta_Rank_2.png",
    "eidolon3": "Meteor Showers for Wish and Want\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/_Rank_3.png",
    "eidolon4": "Aurora Basks in Beauty and Bliss\nAsta's Energy Regeneration Rate increases by 15% when she has 2 or more Charging stacks.",
    "eidolon4Image": "lib/images/Asta_Rank_4.png",
    "eidolon5": "Nebula Secludes in Cold Cosmos\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/Asta_Rank_5.png",
    "eidolon6": "Galaxy Dreams in Calm and Comfort\nCharging stack(s) lost each turn is reduced by 1.",
    "eidolon6Image": "lib/images/Asta_Rank_6.png",
    "ascension2": "Sparks\nAsta's Basic ATK has a 80% base chance to Burn enemies for 3 turn(s).\n\nBurned enemies take Fire DoT equal to 50% of the DMG dealt by Asta's Basic ATK at the start of each turn.",
    "ascension2Image": "lib/images/skills/SkillIcon_Asta_Rank1.png",
    "ascension4": "Ignite\nWhen Asta is on the field, all allies' Fire DMG increases by 18%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Asta_Rank2.png",
    "ascension6": "Constellation\nAsta's DEF increases by 6% for every current Charging stack she posseses.",
    "ascension6Image": "lib/images/skills/SkillIcon_Asta_Ultra.png"
  },
  {
    "name": "Bailu",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Bailu.png",
    "element": "Lighting",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Diagnostic Kick\nSingle Target\nDeals Lightning DMG equal to 50% of Bailu's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Bailu_Normal.png",
    "skill": "Singing Among Clouds\nRestore\nHeals a single ally for 7.8% of Bailu's Max HP plus 78.\nBailu then heals random allies 2 time(s).\nAfter each healing, HP restored from the next healing is reduced by 15%.",
    "skillImage": "lib/images/skills/SkillIcon_Bailu_BP.png",
    "ultimate": "Felicitous Thunderleap\nRestore\nHeals all allies for 9% of Bailu's Max HP plus 90.\nBailu applies Invigoration to allies that are not already Invigorated. For those already Invigorated, Bailu extends the duration of their Invigoration by 1 turn.\nThe effect of Invigoration can last for 2 turn(s). This effect cannot stack.",
    "ultimateImage": "lib/images/skills/SkillIcon_Bailu_Ultra_on.png",
    "Technique": "Saunter in the Rain\nEnhance\nAfter using Technique, at the start of the next battle, all allies are granted Invigoration for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_Bailu_Maze.png",
    "Talent": "Gourdful Elixir\nRestore\nAfter an ally with Invigoration is hit, restores the ally's HP for 3.6% of Bailu's Max HP plus 36. This effect can trigger 2 time(s).\nWhen an ally receives a killing blow, they will not be knocked down. Bailu immediately heals the ally for 12% of Bailu's Max HP plus 120 HP.\nThis effect can be triggered 1 time per battle.",
    "TalentImage": "lib/images/skills/SkillIcon_Bailu_Passive.png",
    "eidolon1": "Ambrosial Aqua\nIf the target ally's current HP is equal to their Max HP when Invigoration ends, regenerates 8 extra Energy for this target.",
    "eidolon1Image": "lib/images/_Rank_.png",
    "eidolon2": "Sylphic Slumber\nAfter using her Ultimate, Bailu's Outgoing Healing increases by an additional 15% for 2 turn(s).",
    "eidolon2Image": "lib/images/_Rank_.png",
    "eidolon3": "Omniscient Opulence\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/_Rank_.png",
    "eidolon4": "Evil Excision\nEvery healing provided by the Skill makes the recipient deal 10% more DMG for 2 turn(s).\nThis effect can stack up to 3 time(s).",
    "eidolon4Image": "lib/images/_Rank_.png",
    "eidolon5": "Waning Worries\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/_Rank_.png",
    "eidolon6": "Drooling Drop of Draconic Divinity\nBailu can heal allies who received a killing blow 1 more time(s) in a single battle.",
    "eidolon6Image": "lib/images/_Rank_.png",
    "ascension2": "Qihuang Analects\nWhen Bailu heals a target ally above their normal Max HP, the target's Max HP increases by 10% for 2 turns.",
    "ascension2Image": "lib/images/skills/SkillIcon_Bailu_Rank1.png",
    "ascension4": "Vidyadhara Geo-Veins\nInvigoration can trigger 1 more time(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_Bailu_Rank2.png",
    "ascension6": "Aquatic Benediction\nCharacters with Invigoration receive 10% less DMG.",
    "ascension6Image": "lib/images/skills/SkillIcon_Bailu_Ultra.png"
  },
  {
    "name": "Blade",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Blade.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Shard Sword\nSingle Target\nSingle Target\nDeals 50% of Blade's ATK as Wind DMG to a target enemy.\n\nBlast\nConsumes HP equal to 10% of Blade's Max HP and deals Wind DMG equal to the sum of 20% of his ATK and 50% of his Max HP to a single enemy. In addition, deals Wind DMG equal to the sum of 8% of Blade's ATK and 20% of his Max HP to adjacent targets.\nIf Blade's current HP is insufficient, his HP will be reduced to 1 when using Forest of Swords.\nForest of Swords cannot regenerate Skill Points.",
    "basicImage": "lib/images/skills/SkillIcon_1205_Normal.png",
    "skill": "Hellscape\nEnhance\nConsumes HP equal to 30% of Blade's Max HP to enter the Hellscape state.\nWhen Hellscape is active, his Skill cannot be used, his DMG dealt increases by 12%, and his Basic ATK Shard Sword is enhanced to Forest of Swords for 3 turn(s).\nIf Blade's current HP is insufficient, his HP will be reduced to 1 when he uses his Skill.\nThis Skill does not regenerate Energy. Using this Skill does not end the current turn.",
    "skillImage": "lib/images/skills/SkillIcon_1205_BP.png",
    "ultimate": "Death Sentence\nBlast\nSets Blade's current HP to 50% of his Max HP and deals to a single enemy Wind DMG equal to the sum of 24% of his ATK, 60% of his Max HP, and 60% of the total HP he has lost in the current battle. At the same time, deals Wind DMG to adjacent targets equal to the sum of 9.6% of his ATK, 24% of his Max HP, and 24% of the total HP he has lost in the current battle.\nThe total HP Blade has lost in the current battle is capped at 90% of his Max HP. This value will be reset and re-accumulated after his Ultimate has been used.",
    "ultimateImage": "lib/images/skills/SkillIcon_1205_Ultra_on.png",
    "Technique": "Karma Wind\nImmediately attacks the enemy. After entering combat, consumes 20% of Blade's Max HP while dealing Wind DMG equal to 40% of his Max HP to all enemies.\nIf Blade's current HP is insufficient, his HP will be reduced to 1 when this Technique is used.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1205_Maze.png",
    "Talent": "Shuhu's Gift\nAoE ATK\nWhen Blade sustains DMG or consumes his HP, he gains 1 stack of Charge, stacking up to 5 times. A max of 1 Charge stack can be gained every time he is attacked.\nWhen Charge stack reaches maximum, immediately launches a follow-up attack on all enemies, dealing Wind DMG equal to 22% of Blade's ATK plus 55% of his Max HP. At the same time, restores Blade's HP by 25% of his Max HP. After the follow-up attack, all Charges are consumed.",
    "TalentImage": "lib/images/skills/SkillIcon_1205_Passive.png",
    "eidolon1": "Blade Cuts the Deepest in Hell\nBlade's Ultimate deals additionally increased DMG to a single enemy target, with the increased amount equal to 150% of Blade's total HP loss in the current battle.\nThe total HP Blade has lost in the current battle is capped at 90% of his Max HP. This value will be reset and re-accumulated after his Ultimate has been used.",
    "eidolon1Image": "lib/images/Blade_Rank_1.png",
    "eidolon2": "Ten Thousand Sorrows From One Broken Dream\nWhen Blade is in the Hellscape state, his CRIT Rate increases by 15%.",
    "eidolon2Image": "lib/images/Blade_Rank_2.png",
    "eidolon3": "Hardened Blade Bleeds Coldest Shade\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/Blade_Rank_3.png",
    "eidolon4": "Rejected by Death, Infected With Life\nWhen Blade's current HP drops to 50% or lower of his Max HP, increases his Max HP by 20%. Stacks up to 2 time(s).",
    "eidolon4Image": "lib/images/Blade_Rank_4.png",
    "eidolon5": "Death By Ten Lords' Gaze\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/Blade_Rank_5.png",
    "eidolon6": "Reborn Into an Empty Husk\nThe maximum number of Charge stacks is reduced to 4. The DMG of the follow-up attack triggered by Blade's Talent additionally increases by 50% of his Max HP.",
    "eidolon6Image": "lib/images/Blade_Rank_6.png",
    "ascension2": "Vita Infinita\nWhen Blade's current HP is at 50% of Max HP or lower, Incoming Healing increases by 20%.",
    "ascension2Image": "lib/images/skills/SkillIcon_1205_Rank1.png",
    "ascension4": "Neverending Deaths\nIf Blade hits a Weakness Broken enemy after using Forest of Swords, he will restore HP equal to 5% of his Max HP plus 100.",
    "ascension4Image": "lib/images/skills/SkillIcon_1205_Rank2.png",
    "ascension6": "Cyclone of Destruction\nDMG dealt by Talent's follow-up attack increases by 20%.",
    "ascension6Image": "lib/images/skills/SkillIcon_1205_Ultra.png"
  },
  {
    "name": "Bronya",
    "path": "Harmony",
    "imagePath": "lib/images/characters/Bronya.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Windrider Bullet\nSingle Target\nDeals Wind DMG equal to 50% of Bronya's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1101_Normal.png",
    "skill": "Combat Redeployment\nSupport\nDispels a debuff from a single ally, allows them to immediately take action, and increases their DMG by 33% for 1 turn(s).\nWhen this Skill is used on Bronya herself, she cannot immediately take action again.",
    "skillImage": "lib/images/skills/SkillIcon_1101_BP.png",
    "ultimate": "The Belobog March\nSupport\nIncreases the ATK of all allies by 33%, and increase their CRIT DMG equal to 12% of Bronya's CRIT DMG plus 12% for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1101_Ultra_on.png",
    "Technique": "Banner of Command\nSupport\nAfter using Bronya's Technique, at the start of the next battle, all allies' ATK increases by 15% for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_1101_Maze.png",
    "Talent": "Leading the Way\nSupport\nAfter using her Basic ATK, Bronya's next action will be Advanced Forward by 15%.",
    "TalentImage": "lib/images/skills/SkillIcon_1101_Passive.png",
    "eidolon1": "Hone Your Strength\nWhen using Skill, there is a 50% fixed chance of recovering 1 Skill Point.\nThis effect has a 1 turn cooldown.",
    "eidolon1Image": "lib/images/Bronya_Rank_1.png",
    "eidolon2": "Quick March\nWhen using Skill, the target ally's SPD increases by 30% after taking action, lasting for 1 turn.",
    "eidolon2Image": "lib/images/Bronya_Rank_2.png",
    "eidolon3": "Bombardment\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/Bronya_Rank_3.png",
    "eidolon4": "Take by Surprise\nAfter an ally other than Bronya uses Basic ATK on an enemy with Wind Weakness, Bronya immediately launches a follow-up attack on the target, dealing Wind DMG equal to 80% of Bronya's Basic ATK DMG.\nThis effect can only be triggered 1 time per turn.",
    "eidolon4Image": "lib/images/Bronya_Rank_4.png",
    "eidolon5": "Unstoppable\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/Bronya_Rank_5.png",
    "eidolon6": "Piercing Rainbow\nThe during of the DMG Boost placed by the Skill on the target ally increases by 1 turn(s).",
    "eidolon6Image": "lib/images/Bronya_Rank_6.png",
    "ascension2": "Command\nThe CRIT Rate for Basic ATK increases to 100%.",
    "ascension2Image": "lib/images/skills/SkillIcon_1101_Rank1.png",
    "ascension4": "Battlefield\nAt the start of the battle, all allies' DEF increases by 20% for 2 turn(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_1101_Rank2.png",
    "ascension6": "Military Might\nWhen Bronya is on the field, all allies deal 10% more DMG.",
    "ascension6Image": "lib/images/skills/SkillIcon_1101_Ultra.png"
  },
  {
    "name": "Clara",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Clara.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/dest.png",
    "basic": "I Want to Help\nSingle Target\nDeals Physical DMG equal to 50% of Clara's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1107_Normal.png",
    "skill": "Svarog Watches Over You\nAoE ATK\nDeals Physical DMG equal to 60% of Clara's ATK to all enemies, and additionally deals Physical DMG equal to 60% of Clara's ATK to enemies marked by Svarog with a Mark of Counter.\nAll Marks of Counter will be removed after this Skill is used.",
    "skillImage": "lib/images/skills/SkillIcon_1107_BP.png",
    "ultimate": "Promise, Not Command\nEnhance\nAfter Clara uses Ultimate, DMG dealt to her is reduced by an extra 15%, and she has a greatly increased chance of being attacked by enemies for 2 turn(s).\nIn addition, Svarog's Counter is enhanced. When an ally is attacked, Svarog immediately launches a Counter, and its DMG multiplier against the enemy increased by 96%.\nEnemies adjacent to it take 50% of the DMG dealt to the target enemy. Enhanced Counter can take effect 2 time(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1107_Ultra_on.png",
    "Technique": "Small Price for Victory\nImmediately attacks the enemy.\nUpon entering battle, the chance Clara will be attacked by enemies increases for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_1107_Maze.png",
    "Talent": "Because We're Family\nEnhance\nUnder the protection of Svarog, DMG taken by Clara is reduced by 10%.\nSvarog will mark enemies who attack Clara with Mark of Counter and retaliate with a Counter, dealing Physical DMG equal to 80% of Clara's ATK.",
    "TalentImage": "lib/images/skills/SkillIcon_1107_Passive.png",
    "eidolon1": "A Tall Figure\nUsing Skill will not remove Mark of Counter on the enemy.",
    "eidolon1Image": "lib/images/Clara_Rank_1.png",
    "eidolon2": "A Tight Embrace\nAfter using the Ultimate, ATK increases by 30% for 2 turn(s).",
    "eidolon2Image": "lib/images/Clara_Rank_2.png",
    "eidolon3": "Cold Steel Armor\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/Clara_Rank_3.png",
    "eidolon4": "Family's Warmth\nAfter Clara is hit, the DMG taken by Clara is reduced by 30%.\nThis effect lasts until the start of her next turn.",
    "eidolon4Image": "lib/images/Clara_Rank_4.png",
    "eidolon5": "A Small Promise\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15",
    "eidolon5Image": "lib/images/Clara_Rank_5.png",
    "eidolon6": "Long Company\nAfter other allies are hit, Svarog also has a 50% fixed chance to trigger a Counter on the attacker and mark them with a Mark of Counter. When using Clara's Ultimate, the number of Enhanced Counters increases by 1.",
    "eidolon6Image": "lib/images/Clara_Rank_6.png",
    "ascension2": "Kinship\nWhen attacked, this character has a 35% fixed chance to remove a debuff placed on them.",
    "ascension2Image": "lib/images/skills/SkillIcon_1107_Rank1.png",
    "ascension4": "Under Protection\nThe chance to resist Crowd Control Debuffs increases by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1107_Rank2.png",
    "ascension6": "Revenge\nIncrease Svarog's Counter DMG by 30%.",
    "ascension6Image": "lib/images/skills/SkillIcon_1107_Ultra_on.png"
  },
  {
    "name": "Dang Heng",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Dan Heng.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Knight Spear Technique: North Wind\nSingle Target\nDeals Wind DMG equal to 50% of Dan Heng's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Dang_Normal.png",
    "skill": "Knight Spear Technique: Torrent\nSingle Target\nDeals Wind DMG equal to 130% of Dan Heng's ATK to a single enemy.\nOn a CRIT Hit, there is a 100% base chance to reduce the target's SPD by 12% for 2 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_Dang_BP.png",
    "ultimate": "Ethereal Dream\nSingle Target\nDeals Wind DMG equal to 240% of Dan Heng's ATK to a single enemy.\nIf the enemy is Slowed, the Ultimate's DMG multiplier increases by 72%.",
    "ultimateImage": "lib/images/skills/SkillIcon_Dang_Ultra_on.png",
    "Technique": "Splitting Spearhead\nEnhance\nAfter Dan Heng uses Technique, his ATK increases by 40% at the start of the next battle for 3 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_Dang_Maze.png",
    "Talent": "Superiority of Reach\nEnhance\nWhen Dan Heng is the target of an ally's Ability, his next attack's Wind RES PEN increases by 18%.\nThis effect can be triggered again after 2 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_Dang_Passive.png",
    "eidolon1": "The Higher You Fly, the Harder You Fall\nWhen the target enemy's current HP is greater than or equal to 50% of their Max HP, CRIT Rate increases by 12%.",
    "eidolon1Image": "lib/images/Dang Heng_Rank_1.png",
    "eidolon2": "Quell the Venom Octet, Quence the Vice O'Flame\nReduces Talent cooldown by 1 turn.",
    "eidolon2Image": "lib/images/Dang Heng_Rank_2.png",
    "eidolon3": "Seen and Unseen\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/Dang Heng_Rank_3.png",
    "eidolon4": "Roaring Dragon and Soaring Sun\nWhen Dan Heng uses his Ultimate to defeat an enemy, his next action is Advanced Forward by 100%.",
    "eidolon4Image": "lib/images/Dang Heng_Rank_4.png",
    "eidolon5": "A Drop of Rain Feeds a Torrent\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/Dang Heng_Rank_5.png",
    "eidolon6": "The Troubled Soul Lies in Wait\nThe Slow state triggered by Skill reduces the enemy's SPD by an additional 8%.",
    "eidolon6Image": "lib/images/Dang Heng_Rank_6.png",
    "ascension2": "Hidden Dragon\nWhen current HP percentage is 50% or lower, reduces the chance of being attacked by enemies",
    "ascension2Image": "lib/images/skills/SkillIcon_Dang_Rank1.png",
    "ascension4": "Shadow of Despair\nWhen launching an attack, there is a 50% fixed chance to increase SPD by 20% for 2 turn(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_Dang_Rank2.png",
    "ascension6": "High Gale\nBasic ATK deals 40% more DMG to Slowed enemies.",
    "ascension6Image": "lib/images/skills/SkillIcon_Dang_Ultra.png"
  },
  {
    "name": "Dang Heng-Imbibitor Lunae",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Dan Heng - Imbibitor Lunae.png",
    "element": "Imaginary",
    "elementImage": "lib/images/imaginary.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Beneficent Lotus\nSingle Target\nSingle Target\n\nUses a 2-hit attack and deals Imaginary DMG equal to 50% of Dan Heng - Imbibitor Lunae's ATK to a single enemy target.\n\nSingle Target\n\nUses a 3-hit attack and deals Imaginary DMG equal to 130% of Dan Heng - Imbibitor Lunae's ATK to a single enemy target.\n\nBlast\n\nUses a 5-hit attack and deals Imaginary DMG equal to 190% of Dan Heng - Imbibitor Lunae's ATK to a single enemy target. From the fourth hit onward, simultaneously deals Imaginary DMG equal to 30% of Dan Heng - Imbibitor Lunae's ATK to adjacent targets.\n\nBlast\n\nUses a 7-hit attack and deals Imaginary DMG equal to 250% of Dan Heng - Imbibitor Lunae's ATK to a single enemy target. From the fourth hit onward, simultaneously deal Imaginary DMG equal to 90% of Dan Heng - Imbibitor Lunae's ATK to adjacent targets.",
    "basicImage": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_Normal.png",
    "skill": "Dracore Libre\nEnhance\nEnhances Basic ATK. Enhancements may be applied up to 3 times consecutively. Using this ability does not consume Skill Points and is not considered as using a Skill.\nEnhanced once, Beneficent Lotus becomes Transcendence.\nEnhanced twice, Beneficent Lotus becomes Divine Spear.\nEnhanced 3 times, Beneficent Lotus becomes Fulgurant Leap.\nWhen using Divine Spear or Fulgurant Leap, starting from the fourth hit, 1 stack of \"Outroar\" is gained before every hit. Each stack of \"Outroar\" increases Dan Heng • Imbibitor Lunae's CRIT DMG by 6%, for a max of 4 stacks. These stacks last until the end of his turn.",
    "skillImage": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_BP.png",
    "ultimate": "Azure's Aqua Ablutes All\nBlast\nUses a 3-hit attack and deals Imaginary DMG equal to 180% of Dan Heng • Imbibitor Lunae's ATK to a single enemy target. At the same time, deals Imaginary DMG equal to 84% of Dan Heng • Imbibitor Lunae's ATK to adjacent targets. Then, obtains 2 Squama Sacrosancta.\nIt's possible to hold up to 3 Squama Sacrosancta, which can be used to offset the consumption of Dan Heng • Imbibitor Lunae's skill points. Consuming Squama Sacrosancta is considered equivalent to consuming skill points.",
    "ultimateImage": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_Ultra_on.png",
    "Technique": "Heaven-Quelling Prismadrakon\nEnhance\nAfter using his Technique, Dan Heng • Imbibitor Lunae enters the Leaping Dragon state for 20 seconds. While in the Leaping Dragon state, using his attack enables him to move forward rapidly for a set distance, attacking all enemies he touches and blocking all incoming attacks. After entering combat via attacking enemies in the Leaping Dragon state, Dan Heng • Imbibitor Lunae deals Imaginary DMG equal to 120% of his ATK to all enemies, and gains 1 Squama Sacrosancta.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_Maze.png",
    "Talent": "Righteous Heart\nEnhance\nAfter each hit dealt during an attack, Dan Heng • Imbibitor Lunae gains 1 stack of Righteous Heart, increasing his DMG by 5%. This effect can stack up to 6 time(s), lasting until the end of his turn.",
    "TalentImage": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_Passive.png",
    "eidolon1": "Tethered to Sky\nIncreases the stackable Righteous Heart count by 4, and gains 1 extra stack of Righteous Heart for each hit during an attack.",
    "eidolon1Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_1.png",
    "eidolon2": "Imperium On Cloud Nine\nAfter using his Ultimate, Dan Heng • Imbibitor Lunae's action is Advanced Forward by 100% and gains 1 extra Squama Sacrosancta.",
    "eidolon2Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_2.png",
    "eidolon3": "Clothed in Clouds\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_3.png",
    "eidolon4": "Zephyr's Bliss\nThe buff effect granted by Outroar lasts until the end of this character's next turn.",
    "eidolon4Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_4.png",
    "eidolon5": "Fall is the Pride\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_5.png",
    "eidolon6": "Reign, Returned\nAfter any other ally uses their Ultimate, the Imaginary RES PEN of Dan Heng • Imbibitor Lunae's next Fulgurant Leap attack increases by 20%. This effect can stack up to 3 time(s).",
    "eidolon6Image": "lib/images/edions/Dan Heng - Imbibitor Lunae_Rank_6.png",
    "ascension2": "Star Veil\nAt the start of the battle, immediately regenerates 15 Energy.",
    "ascension2Image": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_SkillTree1.png",
    "ascension4": "Aqua Reign\nIncreases the chance to resist Crowd Control debuffs by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_SkillTree2.png",
    "ascension6": "Jolt Anew\nThis character's CRIT DMG increases by 24% when dealing DMG to enemy targets with Imaginary Weakness.",
    "ascension6Image": "lib/images/skills/SkillIcon_Dan Heng - Imbibitor Lunae_SkillTree3.png"
  },
  {
    "name": "Dr.Ratio",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Dr. Ratio.png",
    "element": "Imaginary",
    "elementImage": "lib/images/imaginary.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Mind is Might\nSingle Target\nDeals Imaginary DMG equal to 50% of Dr. Ratio's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Dr. Ratio_Normal.png",
    "skill": "Intellectual Midwifery\nSingle Target\nDeals Imaginary DMG equal to 75% of Dr. Ratio's ATK to a single target enemy.",
    "skillImage": "lib/images/skills/SkillIcon_Dr. Ratio_BP.png",
    "ultimate": "Syllogistic Paradox\nSingle Target\nDeals Imaginary DMG equal to 144% of Dr. Ratio's ATK to a single target enemy and applies Wiseman's Folly. When Dr. Ratio's allies attack a target afflicted with Wiseman's Folly, Dr. Ratio launches his Talent's follow-up attack for 1 time against this target.\nWiseman's Folly can be triggered for up to 2 times and only affects the most recent target of Dr. Ratio's Ultimate. This trigger count resets after Dr. Ratio's Ultimate is used.",
    "ultimateImage": "lib/images/skills/SkillIcon_Dr. Ratio_Ultra_on.png",
    "Technique": "Mold of Idolatry\nImpair\nAfter using Technique, creates a special dimension that Taunts nearby enemies, lasting for 10 second(s). After entering battle with enemies in this special dimension, there is a 100% base chance to reduce each single enemy target's SPD by 15% for 2 turn(s). Only 1 dimension created by allies can exist at the same time.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Dr. Ratio_Maze.png",
    "Talent": "Cogito, Ergo Sum\nSingle Target\nWhen using his Skill, Dr. Ratio has a 40% fixed chance of launching a follow-up attack against his target for 1 time, dealing Imaginary DMG equal to 135% of Dr. Ratio's ATK. For each debuff the target enemy has, the fixed chance of launching follow-up attack increases by 20%. If the target enemy is defeated before the follow-up attack triggers, the follow-up attack will be directed at a single random enemy instead.",
    "TalentImage": "lib/images/skills/SkillIcon_Dr. Ratio_Passive.png",
    "eidolon1": "Pride Comes Before a Fall\nThe maximum stackable count for the Trace \"Summation\" increases by 4. When a battle begins, immediately obtains 4 stacks of Summation. Needs to unlock Summation first.",
    "eidolon1Image": "lib/images/edions/Dr. Ratio_Rank_1.png",
    "eidolon2": "The Divine Is in the Details\nWhen his Talent's follow-up attack hits a target, for every debuff the target has, additionally deals Imaginary Additional DMG equal to 20% of Dr. Ratio's ATK. This effect can be triggered for a maximum of 4 time(s) during each follow-up attack.",
    "eidolon2Image": "lib/images/edions/Dr. Ratio_Rank_2.png",
    "eidolon3": "Know Thyself\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Dr. Ratio_Rank_3.png",
    "eidolon4": "Ignorance Is Blight\nWhen triggering the Talent, additionally regenerates 15 Energy for Dr. Ratio.",
    "eidolon4Image": "lib/images/edions/Dr. Ratio_Rank_4.png",
    "eidolon5": "Sic Itur Ad Astra\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Dr. Ratio_Rank_5.png",
    "eidolon6": "Vincit Omnia Veritas\nIncreases the trigger count for Wiseman's Folly by 1. The DMG dealt by the Talent's follow-up attack increases by 50%.\n\n",
    "eidolon6Image": "lib/images/edions/Dr. Ratio_Rank_6.png",
    "ascension2": "Summation\nWhen Dr. Ratio uses his Skill, for every debuff on the target, his CRIT Rate increases by 2.5% and CRIT DMG by 5%. This effect can stack up to 6 time(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_Dr. Ratio_SkillTree1.png",
    "ascension4": "Inference\nWhen Skill is used to attack an enemy target, there is a 100% base chance to reduce the attacked target's Effect RES by 10% for 2 turn(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_Dr. Ratio_SkillTree2.png",
    "ascension6": "Deduction\nWhen dealing DMG to a target that has 3 or more debuff(s), for each debuff the target has, the DMG dealt by Dr. Ratio to this target increases by 10%, up to a maximum increase of 50%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Dr. Ratio_SkillTree3.png"
  },
  {
    "name": "Fu Xuan",
    "path": "Preservation",
    "imagePath": "lib/images/characters/FuXuan.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/per.png",
    "basic": "Novaburst\nSingle Target\nDeals Quantum DMG equal to 25% of Fu Xuan's Max HP to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_FuXuan_Normal.png",
    "skill": "Known by Stars, Shown by Hearts\nDefense\nActivates Matrix of Prescience, via which other team members will Distribute 65% of the DMG they receive (before this DMG is mitigated by any Shields) to Fu Xuan for 3 turn(s).\nWhile affected by Matrix of Prescience, all team members gain the Knowledge effect, which increases their respective Max HP by 3% of Fu Xuan's Max HP, and increases CRIT Rate by 6%.\nWhen Fu Xuan is knocked down, the Matrix of Prescience will be dispelled.",
    "skillImage": "lib/images/skills/SkillIcon_FuXuan_BP.png",
    "ultimate": "Woes of Many Morphed to One\nAoE ATK\nDeals Quantum DMG equal to 60% of Fu Xuan's Max HP to all enemies and obtains 1 trigger count for the HP Restore effect granted by Fu Xuan's Talent.",
    "ultimateImage": "lib/images/skills/SkillIcon_FuXuan_Ultra_on.png",
    "Technique": "Of Fortune Comes Fate\nDefense\nAfter the Technique is used, all team members receive a Barrier, lasting for 20 seconds. This Barrier can block all enemy attacks, and the team will not enter battle when attacked. Entering battle while the Barrier is active will have Fu Xuan automatically activate Matrix of Prescience at the start of the battle, lasting for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_FuXuan_Maze.png",
    "Talent": "Bleak Breeds Bliss\nRestore\nWhile Fu Xuan is still active in battle, Misfortune Avoidance is applied to the entire team. With Misfortune Avoidance, allies take 10% less DMG.\nWhen Fu Xuan's current HP falls to 50% of her Max HP or less, HP Restore will be triggered for Fu Xuan, restoring her HP by 80% of the amount of HP she is currently missing. This effect cannot be triggered if she receives a killing blow. This effect possesses 1 trigger count by default and can have a maximum of 2 trigger counts.",
    "TalentImage": "lib/images/skills/SkillIcon_FuXuan_Passive.png",
    "eidolon1": "Dominus Pacis\nThe Knowledge effect increases CRIT DMG by 30%.",
    "eidolon1Image": "lib/images/edions/FuXuan_Rank_1.png",
    "eidolon2": "Optimus Felix\nIf any team member is struck by a killing blow while Matrix of Prescience is active, then all allies who were struck by a killing blow during this action will not be knocked down, and 70% of their Max HP is immediately restored. This effect can trigger 1 time per battle.",
    "eidolon2Image": "lib/images/edions/FuXuan_Rank_2.png",
    "eidolon3": "Apex Nexus\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/FuXuan_Rank_3.png",
    "eidolon4": "Fortuna Stellaris\nWhen other allies under Matrix of Prescience are attacked, Fu Xuan regenerates 5 Energy.",
    "eidolon4Image": "lib/images/edions/FuXuan_Rank_4.png",
    "eidolon5": "Arbiter Primus\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/FuXuan_Rank_5.png",
    "eidolon6": "Omnia Vita\nOnce Matrix of Prescience is activated, it will keep a tally of the total HP lost by all team members in the current battle. Fu Xuan's Ultimate DMG will increase by 200% of this tally of HP loss.\nThis tally is also capped at 120% of Fu Xuan's Max HP and the tally value will reset and re-accumulate after Fu Xuan's Ultimate is used.",
    "eidolon6Image": "lib/images/edions/FuXuan_Rank_6.png",
    "ascension2": "Taiyi, the Macrocosmic\nWhen Matrix of Prescience is active, Fu Xuan will regenerate 20 extra Energy when she uses her Skill.",
    "ascension2Image": "lib/images/skills/SkillIcon_FuXuan_SkillTree1.png",
    "ascension4": "Dunjia, the Metamystic\nWhen Fu Xuan's Ultimate is used, heals all other allies by an amount equal to 5% of Fu Xuan's Max HP plus 133.",
    "ascension4Image": "lib/images/skills/SkillIcon_FuXuan_SkillTree2.png",
    "ascension6": "Liuren, the Sexagenary\nIf a target enemy applies Crowd Control debuffs to allies while the Matrix of Prescience is active, all allies will resist all Crowd Control debuffs applied by the enemy target during the current action. This effect can only be triggered once. When Matrix of Prescience is activated again, the number of times this effect can be triggered will reset.",
    "ascension6Image": "lib/images/skills/SkillIcon_FuXuan_SkillTree3.png"
  },
  {
    "name": "Gallagher",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Gallagher.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Corkage Fee\nSingle Target\nDeals Fire DMG equal to 50% of Gallagher's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_3019_Normal.png",
    "skill": "Special Brew\nRestore\nImmediately heals a target ally for 200 HP.",
    "skillImage": "lib/images/skills/SkillIcon_3019_BP.png",
    "ultimate": "Champagne Etiquette\nAoE\nInflicts Besotted on all enemies, lasting for 2 turn(s). At the same time, deals Fire DMG equal to 75% of Gallagher's ATK to all enemies, and enhances this unit's next Basic ATK to Nectar Blitz.",
    "ultimateImage": "lib/images/skills/SkillIcon_3019_Ultra_on.png",
    "Technique": "Artisan Elixir\nBreak\nImmediately attacks the enemy. Upon entering battle, inflicts Besotted on all enemies, lasting for 2 turn(s). And deals Fire DMG equal to 50% of Gallagher's ATK to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_3019_Maze.png",
    "Talent": "Tipsy Tussle\nRestore\nThe Besotted state increases the Break DMG that targets receive by 6%. Every time a Besotted target is attacked by an ally, the attacker's HP gets restored by 80.",
    "TalentImage": "lib/images/skills/SkillIcon_3019_Passive.png",
    "eidolon1": "Salty Dog\nWhen Gallagher enters the battle, regenerates 20 Energy and increases Effect RES by 50%.",
    "eidolon1Image": "lib/images/edions/Gallagher_1.png",
    "eidolon2": "Lion's Tail\nWhen using the Skill, removes 1 debuff(s) from a target ally. At the same time, increases their Effect RES by 30%, lasting for 2 turn(s).",
    "eidolon2Image": "lib/images/edions/Gallagher_2.png",
    "eidolon3": "Corpse Reviver\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Gallagher_3.png",
    "eidolon4": "Last Word\nExtends the duration of the Besotted state inflicted by Gallagher's Ultimate by 1 turn(s).",
    "eidolon4Image": "lib/images/edions/Gallagher_4.png",
    "eidolon5": "Death in the Afternoon\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Gallagher_5.png",
    "eidolon6": "Blood and Sand\nIncreases Gallagher's Break Effect by 20% and Weakness Break Efficiency by 20%.",
    "eidolon6Image": "lib/images/edions/Gallagher_6.png",
    "ascension2": "Novel Concoction\nIncreases this unit's Outgoing Healing by an amount equal to 50% of Break Effect, up to a maximum Outgoing Healing increase of 75%.",
    "ascension2Image": "lib/images/skills/SkillIcon_3019_Rank1.png",
    "ascension4": "Organic Yeast\nAfter using the Ultimate, immediately Advances Forward this unit's Action by 100%.",
    "ascension4Image": "lib/images/skills/SkillIcon_3019_Rank2.png",
    "ascension6": "Bottoms Up\nWhen Gallagher uses Nectar Blitz to attack Besotted enemies, the HP Restore effect of his Talent will also apply to other allies for this time.",
    "ascension6Image": "lib/images/skills/SkillIcon_3019_Ultra.png"
  },
  {
    "name": "Gepard",
    "path": "Preservation",
    "imagePath": "lib/images/characters/Gepard.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/per.png",
    "basic": "Fist of Conviction\nSingle Target\nDeals Ice DMG equal to 50% of Gepard's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1104_Normal.png",
    "skill": "Daunting Smite\nImpair\nDeals Ice DMG equal to 100% of Gepard's ATK to a single enemy, with a 65% base chance to Freeze the enemy for 1 turn(s).\nWhile Frozen, the enemy cannot take action and will take Additional Ice DMG equal to 30% of Gepard's ATK at the beginning of each turn.",
    "skillImage": "lib/images/skills/SkillIcon_1104_BP.png",
    "ultimate": "Enduring Bulwark\nDefense\nApplies a Shield to all allies, absorbing DMG equal to 30% of Gepard's DEF plus 150 for 3 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1104_Ultra_on.png",
    "Technique": "Comradery\nDefense\nAfter Gepard uses his Technique, when the next battle begins, a Shield will be applied to all allies, absorbing DMG equal to 24% of Gepard's DEF plus 150 for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_1104_Maze.png",
    "Talent": "Unyielding Will\nRestore\nWhen struck with a killing blow, instead of becoming knocked down, Gepard's HP immediately restores to 25% of his Max HP.\nThis effect can only trigger once per battle.",
    "TalentImage": "lib/images/skills/SkillIcon_1104_Passive.png",
    "eidolon1": "Due Diligence\nWhen using Skill, increases the base chance to Freeze enemies by 35%.",
    "eidolon1Image": "lib/images/edions/Gepard_Rank_1.png",
    "eidolon2": "Lingering Cold\nAfter an enemy Frozen by Skill is unfrozen, their SPD is reduced by 20% for 1 turn(s).",
    "eidolon2Image": "lib/images/edions/Gepard_Rank_2.png",
    "eidolon3": "Never Surrender\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Gepard_Rank_3.png",
    "eidolon4": "Faith Moves Mountains\nWhen Gepard is in battle, all allies' Effect RES increases by 20%.",
    "eidolon4Image": "lib/images/edions/Gepard_Rank_4.png",
    "eidolon5": "Cold Iron Fist\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Gepard_Rank_5.png",
    "eidolon6": "Unyielding Resolve\nWhen his Talent is triggered, Gepard's action is Advanced Forward by 100%, and he restores extra HP equal to 50% of his Max HP.",
    "eidolon6Image": "lib/images/edions/Gepard_Rank_6.png",
    "ascension2": "Integrity\nGepard has a higher chance to be attacked by enemies.",
    "ascension2Image": "lib/images/skills/SkillIcon_1104_Rank1.png",
    "ascension4": "Commander\nWhen \"Unyielding Will\" is triggered, Gepard's Energy will be restored to 100%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1104_Rank2.png",
    "ascension6": "Fighting Spirit\nGepard's ATK increases by 35% of his current DEF.\nThis effect will refresh at the start of each turn.",
    "ascension6Image": "lib/images/skills/SkillIcon_1104_Ultra.png"
  },
  {
    "name": "Guinaifen",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Guinaifen.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Standing Ovation\nSingle Target\nDeals Fire DMG equal to 50% of Guinaifen's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Guinaifen_Normal.png",
    "skill": "Blazing Welcome\nBlast\nDeals Fire DMG equal to 60% of Guinaifen's ATK to a single enemy and deals Fire DMG equal to 20% of Guinaifen's ATK to any adjacent enemies with a 100% base chance to Burn the target and adjacent targets. When Burned, enemies will take a Fire DoT equal to 83.9% of Guinaifen's ATK at the beginning of each turn, lasting for 2 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_Guinaifen_BP.png",
    "ultimate": "Watch This Showstopper\nAoE ATK\nDeals Fire DMG equal to 72% of Guinaifen's ATK to all enemies. If the target enemy is currently inflicted with Burn, then their Burn status immediately produce DMG equal to 72% of their original DMG.",
    "ultimateImage": "lib/images/skills/SkillIcon_Guinaifen_Ultra_on.png",
    "Technique": "Skill Showcase\nImmediately attacks the enemy. After entering battle, deals DMG for 4 time(s), dealing Fire DMG equal to 50% of Guinaifen's ATK to a random single enemy target each time, with a 100% base chance of inflicting Firekiss on them.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Guinaifen_Maze.png",
    "Talent": "PatrAeon Benefits\nImpair\nWhen Guinaifen is on the field, there is a 100% base chance to apply Firekiss to an enemy after their Burn status causes DMG. While inflicted with Firekiss, the enemy receives 4% increased DMG, which lasts for 3 turn(s) and can stack up to 3 time(s).",
    "TalentImage": "lib/images/skills/SkillIcon_Guinaifen_Passive.png",
    "eidolon1": "Slurping Noodles During Handstand\nWhen Skill is used, there is a 100% base chance to reduce the attacked target enemy's Effect RES by 10% for 2 turn(s).",
    "eidolon1Image": "lib/images/edions/Guinaifen_Rank_1.png",
    "eidolon2": "Brushing Teeth While Whistling\nWhen an enemy target is Burned, Guinaifen's Basic ATK and Skill can increase the DMG multiplier of their Burn status by 40%.",
    "eidolon2Image": "lib/images/edions/Guinaifen_Rank_2.png",
    "eidolon3": "Smashing Boulder on Chest\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Guinaifen_Rank_3.png",
    "eidolon4": "Blocking Pike with Neck\nEvery time the Burn status inflicted by Guinaifen causes DMG, Guinaifen regenerates 2 Energy.",
    "eidolon4Image": "lib/images/edions/Guinaifen_Rank_4.png",
    "eidolon5": "Swallowing Sword to Stomach\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Guinaifen_Rank_5.png",
    "eidolon6": "Catching Bullet with Hands\nIncreases the stackable Firekiss count by 1.",
    "eidolon6Image": "lib/images/edions/Guinaifen_Rank_6.png",
    "ascension2": "High Poles\nBasic ATK has a 80% base chance of inflicting an enemy with a Burn, equivalent to that of Skill.",
    "ascension2Image": "lib/images/skills/SkillIcon_Guinaifen_SkillTree1.png",
    "ascension4": "Bladed Hoop\nWhen the battle begins, Guinaifen's action is advanced forward by 25%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Guinaifen_Rank2.png",
    "ascension6": "Walking on Knives\nDeals 20% more DMG to Burned enemies.",
    "ascension6Image": "lib/images/skills/SkillIcon_Guinaifen_SkillTree3.png"
  },
  {
    "name": "Hanya",
    "path": "Harmony",
    "imagePath": "lib/images/characters/Hanya.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Oracle Brush\nSingle Target\nDeals Physical DMG equal to 50% of Hanya's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Hanya_Normal.png",
    "skill": "Samsara, Locked\nSingle Target\nDeals Physical DMG equal to 120% of Hanya's ATK to a single enemy, then applies Burden to them.\nFor every 2 Basic ATKs, Skills, or Ultimates allies use on an enemy with Burden, allies will immediately recover 1 Skill Point. Burden is only active on the latest target it is applied to, and will be dispelled automatically after the Skill Point recovery effect has been triggered 2 times.",
    "skillImage": "lib/images/skills/SkillIcon_Hanya_BP.png",
    "ultimate": "Ten-Lords' Decree, All Shall Obey\nEnhance\nIncreases the SPD of a target ally by 15% of Hanya's SPD and increases the same target ally's ATK by 36%, lasting for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_Hanya_Ultra_on.png",
    "Technique": "Netherworld Judgment\nBreak\nImmediately attacks the enemy. After entering battle, applies Burden equivalent to that applied by the Skill to a random enemy.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Hanya_Maze.png",
    "Talent": "Sanction\nSupport\nWhen an ally uses a Basic ATK, Skill, or Ultimate on an enemy inflicted with Burden, the DMG dealt increases by 15%, lasting for 2 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_Hanya_Passive.png",
    "eidolon1": "One Heart\nWhen an ally with Hanya's Ultimate's effect defeats an enemy, Hanya's action is Advanced Forward by 15%. This effect can only be triggered 1 time(s) per turn.",
    "eidolon1Image": "lib/images/edions/Hanya_Rank_1.png",
    "eidolon2": "Two Views\nAfter using the Skill, this character's SPD increases by 20% for 1 turn(s).",
    "eidolon2Image": "lib/images/edions/Hanya_Rank_2.png",
    "eidolon3": "Three Temptations\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Hanya_Rank_3.png",
    "eidolon4": "Four Truths\nThe Ultimate's duration is additionally extended for 1 turn(s).",
    "eidolon4Image": "lib/images/edions/Hanya_Rank_4.png",
    "eidolon5": "Five Skandhas\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15",
    "eidolon5Image": "lib/images/edions/Hanya_Rank_5.png",
    "eidolon6": "Six Reverences\nIncrease the DMG Boost effect of the Talent by an additional 10%.",
    "eidolon6Image": "lib/images/edions/Hanya_Rank_6.png",
    "ascension2": "Scrivener\nAllies triggering Burden's Skill Point recovery effect have their ATK increased by 10% for 1 turn(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_Hanya_Rank6.png",
    "ascension4": "Netherworld\nIf the trigger count for the Burden's Skill Point recovery effect is 1 or lower when an enemy with Burden is defeated, then additionally recovers 1 Skill Point(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_Hanya_SkillTree2.png",
    "ascension6": "Reanimated\nWhen Burden's Skill Point recovery effect is triggered, this character regenerates 2 Energy.",
    "ascension6Image": "lib/images/skills/SkillIcon_Hanya_BP.png"
  },
  {
    "name": "Herta",
    "path": "Erudition",
    "imagePath": "lib/images/characters/Herta.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/era.png",
    "basic": "What Are You Looking At?\nSingle Target\nDeals Ice DMG equal to 50% of Herta's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Herta_Normal.png",
    "skill": "One-Time Offer\nAoE ATK\nDeals Ice DMG equal to 50% of Herta's ATK to all enemies.\nIf the enemy's HP percentage is 50% or higher, DMG dealt to this target increases by 20%.",
    "skillImage": "lib/images/skills/SkillIcon_Herta_BP.png",
    "ultimate": "It's Magic, I Added Some Magic\nAoE ATK\nDeals Ice DMG equal to 120% of Herta's ATK to all enemies.",
    "ultimateImage": "lib/images/skills/SkillIcon_Herta_Ultra_on.png",
    "Technique": "Fine, I'll Do It Myself\nAoE ATK\nWhen an ally's attack causes an enemy's HP percentage to fall to 50% or lower, Herta will launch a follow-up attack, dealing Ice DMG equal to 25% of Herta's ATK to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Herta_Maze.png",
    "Talent": "It Can Still Be Optimized\nEnhance\nAfter using her Technique, Herta's ATK increases by 40% for 3 turn(s) at the beginning of the the next battle.",
    "TalentImage": "lib/images/skills/SkillIcon_Herta_Passive.png",
    "eidolon1": "Kick You When You're Down\nIf the enemy's HP percentage is at 50% or less, Herta's Basic ATK deals additional Ice DMG equal to 40% of Herta's ATK.",
    "eidolon1Image": "lib/images/edions/Herta_Rank_1.png",
    "eidolon2": "Keep the Ball Rolling\nEvery time Talent is triggered, this character's CRIT Rate increases by 3%. This effect can stack up to 5 time(s).",
    "eidolon2Image": "lib/images/edions/Herta_Rank_2.png",
    "eidolon3": "That's the Kind of Girl I Am\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Herta_Rank_3.png",
    "eidolon4": "Hit Where It Hurts\nWhen Talent is triggered, DMG increases by 10%.",
    "eidolon4Image": "lib/images/edions/Herta_Rank_4.png",
    "eidolon5": "Cuss Big or Cuss Nothing\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Herta_Rank_5.png",
    "eidolon6": "No One Can Betray Me\nAfter using Ultimate, this character's ATK increases by 25% for 1 turn(s).",
    "eidolon6Image": "lib/images/edions/Herta_Rank_6.png",
    "ascension2": "Efficiency\nWhen Skill is used, the DMG Boost on target enemies increases by an extra 25%.",
    "ascension2Image": "lib/images/skills/SkillIcon_Herta_Rank1.png",
    "ascension4": "Puppet\nThe chance to resist Crowd Control debuffs increases by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Herta_Rank2.png",
    "ascension6": "Icing\nWhen Ultimate is used, deals 20% more DMG to Frozen enemies.",
    "ascension6Image": "lib/images/skills/SkillIcon_1104_Maze.png"
  },
  {
    "name": "Himeko",
    "path": "Erudition",
    "imagePath": "lib/images/characters/Himeko.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/era.png",
    "basic": "Sawblade Tuning\nSingle Target\nDeals Fire DMG equal to 50% of Himeko's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Himeko_Normal.png",
    "skill": "Molten Detonation\nBlast\nDeals Fire DMG equal to 100% of Himeko's ATK to a single enemy and Fire DMG equal to 40% of Himeko's ATK to any adjacent enemies.",
    "skillImage": "lib/images/skills/SkillIcon_Himeko_BP.png",
    "ultimate": "Heavenly Flare\nAoE ATK\nDeals Fire DMG equal to 138% of Himeko's ATK to all enemies.\nAdditionally, Himeko regenerates 5 Energy for each enemy defeated.",
    "ultimateImage": "lib/images/skills/SkillIcon_Himeko_Ultra_on.png",
    "Technique": "Incomplete Combustion\nImpair\nAfter using Technique, creates a dimension that lasts for 15 second(s).\nAfter entering battle with enemies in the dimension, there is a 100% base chance to increase Fire DMG taken by enemies by 10% for 2 turn(s). Only 1 dimension created by allies can exist at the same time.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Himeko_Maze.png",
    "Talent": "Victory Rush\nAoE ATK\nWhen an enemy is inflicted with Weakness Break, Himeko gains 1 point of Charge (max 3 points).\nIf Himeko is fully Charged when ally performs an attack, Himeko immediately performs 1 follow-up attack and deals Fire DMG equal to 70% of her ATK to all enemies, consuming all Charge points.\nAt the start of the battle, Himeko gains 1 point of Charge.",
    "TalentImage": "lib/images/skills/SkillIcon_Himeko_Passive.png",
    "eidolon1": "Childhood\nAfter \"Victory Rush\" is triggered, Himeko's SPD increases by 20% for 2 turn(s).",
    "eidolon1Image": "lib/images/edions/Himeko_Rank_1.png",
    "eidolon2": "Convergence\nDeals 15% more DMG to enemies whose HP percentage is 50% or less.",
    "eidolon2Image": "lib/images/edions/Himeko_Rank_2.png",
    "eidolon3": "Poised\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Himeko_Rank_3.png",
    "eidolon4": "Dedication\nWhen Himeko's Skill inflicts Weakness Break on an enemy, she gains 1 extra point(s) of Charge.",
    "eidolon4Image": "lib/images/edions/Himeko_Rank_4.png",
    "eidolon5": "Aspiration\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Himeko_Rank_5.png",
    "eidolon6": "Trailblaze!\nUltimate deals DMG 2 extra times, each of which deals Fire DMG equal to 40% of the original DMG to a random enemy.",
    "eidolon6Image": "lib/images/edions/Himeko_Rank_6.png",
    "ascension2": "Starfire\nAfter using an attack, there is a 50% base chance to inflict Burn on enemies for 2 turn(s).\n\nWhen afflicted with Burn, enemies take Fire DoT equal to 30% of Himeko's Basic ATK at the start of each turn.",
    "ascension2Image": "lib/images/skills/SkillIcon_Himeko_Rank1.png",
    "ascension4": "Magma\nSkill deals 20% more DMG to enemies currently afflicted with Burn.",
    "ascension4Image": "lib/images/skills/SkillIcon_Himeko_Rank2.png",
    "ascension6": "Benchmark\nWhen current HP percentage is 80% or higher, CRIT Rate increases by 15%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Himeko_Ultra.png"
  },
  {
    "name": "Hook",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Hook.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Hehe! Don't Get Burned!\nSingle Target\nDeals Fire DMG equal to 50% of Hook's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1109_Normal.png",
    "skill": "Hey! Remember Hook?\nSingle Target\nSingle Target\nDeals Fire DMG equal to 120% of Hook's ATK to a single enemy. In addition, there is a 100% base chance to inflict Burn for 2 turn(s).\nWhen afflicted with Burn, enemies will take Fire DoT equal to 25% of Hook's ATK at the beginning of each turn.\n\nBlast\nDeals Fire DMG equal to 140% of Hook's ATK to a single enemy, with a 100% base chance to Burn them for 2 turn(s).\nAdditionally, deals Fire DMG equal to 40% of Hook's ATK to enemies adjacent to it.\nWhen afflicted with Burn, enemies will take Fire DoT equal to 25% of Hook's ATK at the beginning of each turn.",
    "skillImage": "lib/images/skills/SkillIcon_1109_BP.png",
    "ultimate": "Boom! Here Comes the Fire!\nSingle Target\nDeals Fire DMG equal to 240% of Hook's ATK to a single enemy.\nAfter using Ultimate, the next Skill to be used is Enhanced, which deals DMG to a single enemy and enemies adjacent to it.",
    "ultimateImage": "lib/images/skills/SkillIcon_1109_Ultra_on.png",
    "Technique": "Ack! Look at This Mess!\nImmediately attacks the enemy.\nUpon entering battle, Hook deals Fire DMG equal to 50% of her ATK to a random enemy.\nIn addition, there is a 100% base chance to inflict Burn on every enemy for 3 turn(s).\nWhen afflicted with Burn, enemies will take Fire DoT equal to 50% of Hook's ATK at the beginning of each turn.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1109_Maze.png",
    "Talent": "Ha! Oil to the Flames!\nEnhance\nWhen attacking a target afflicted with Burn, deals Additional Fire DMG equal to 50% of Hook's ATK and regenerates 5 extra Energy.",
    "TalentImage": "lib/images/skills/SkillIcon_1109_Passive.png",
    "eidolon1": "Early to Bed, Early to Rise\nEnhanced Skill deals 20% increased DMG.",
    "eidolon1Image": "lib/images/edions/Hook_Rank_1.png",
    "eidolon2": "Happy Tummy, Happy Body\nExtends the duration of Burn caused by Skill by 1 turn(s).",
    "eidolon2Image": "lib/images/edions/Hook_Rank_2.png",
    "eidolon3": "Don't Be Picky, Nothing's Icky\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Hook_Rank_3.png",
    "eidolon4": "It's Okay to Not Know\nWhen Talent is triggered, there is a 100% base chance to Burn enemies adjacent to the target enemy, equivalent to that of Skill.",
    "eidolon4Image": "lib/images/edions/Hook_Rank_4.png",
    "eidolon5": "Let the Moles' Deeds Be Known\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Hook_Rank_5.png",
    "eidolon6": "Always Ready to Punch and Kick\nHook deals 20% more DMG to enemies afflicted with Burn.",
    "eidolon6Image": "lib/images/edions/Hook_Rank_6.png",
    "ascension2": "Innocence\nHook restores HP equal to 5% of her Max HP whenever her Talent is triggered.",
    "ascension2Image": "lib/images/skills/SkillIcon_1109_Rank1.png",
    "ascension4": "Naivete\nThe chance to resist Crowd Control Debuffs increases by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1109_Rank2.png",
    "ascension6": "Playing with Fire\nWhen using her Ultimate, Hook has her action Advanced Forward by 20% and Hook additionally regenerates 5 Energy.",
    "ascension6Image": "lib/images/skills/SkillIcon_1109_Ultra.png"
  },
  {
    "name": "Huohuo",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Huohuo.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Banner: Stormcaller\nSingle Target\nDeals Wind DMG equal to 25% of Huohuo's Max HP to a target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Huohuo_Normal.png",
    "skill": "Talisman: Protection\nRestore\nDispels 1 debuff(s) from a single target ally and immediately restores this ally's HP by an amount equal to 14% of Huohuo's Max HP plus 140. At the same time, restores HP for allies that are adjacent to this target ally by an amount equal to 11.2% of Huohuo's Max HP plus 112.",
    "skillImage": "lib/images/skills/SkillIcon_Huohuo_BP.png",
    "ultimate": "Tail: Spiritual Domination\nSupport\nRegenerates Energy for all allies (excluding this character) by an amount equal to 15% of their respective Max Energy. At the same time, increases their ATK by 24% for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_Huohuo_Ultra_on.png",
    "Technique": "Fiend: Impeachment of Evil\nImpair\nHuohuo terrorizes surrounding enemies, afflicting Horror-Struck on them. Enemies in Horror-Struck will flee away from Huohuo for 10 second(s). When entering battle with enemies in Horror-Struck, there is a 100% base chance of reducing every single enemy's ATK by 25% for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_Huohuo_Maze.png",
    "Talent": "Possession: Ethereal Metaflow\nRestore\nAfter using her Skill, Huohuo gains Divine Provision, lasting for 2 turn(s). This duration decreases by 1 turn at the start of each Huohuo's turn. If Huohuo has Divine Provision when an ally's turn starts or when an ally uses their Ultimate, restores HP for that ally by an amount equal to 3% of Huohuo's Max HP plus 30. At the same time, every ally with 50% HP or lower receives healing once.\nWhen Divine Provision is triggered to heal an ally, dispel 1 debuff(s) from that ally. This effect can be triggered up to 6 time(s). Using the skill again resets the effect's trigger count.",
    "TalentImage": "lib/images/skills/SkillIcon_Huohuo_Passive.png",
    "eidolon1": "Anchored to Vessel, Specters Nestled\nThe duration of Divine Provision produced by the Talent is extended by 1 turn(s). When Huohuo possesses Divine Provision, all allies' SPD increases by 12%.",
    "eidolon1Image": "lib/images/edions/Huohuo_Rank_1.png",
    "eidolon2": "Sealed in Tail, Wraith Subdued\nIf Huohuo possesses Divine Provision when an ally is struck by a killing blow, the ally will not be knocked down, and their HP will immediately be restored by an amount equal to 50% of their Max HP. This reduces the duration of Divine Provision by 1 turn. This effect can only be triggered 2 time(s) per battle.",
    "eidolon2Image": "lib/images/edions/Huohuo_Rank_2.png",
    "eidolon3": "Cursed by Fate, Moths to Flame\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Huohuo_Rank_3.png",
    "eidolon4": "Tied in Life, Bound to Strife\nWhen healing a target ally via Skill or Talent, the less HP the target ally currently has, the higher the amount of healing they will receive. The maximum increase in healing provided by Huohuo is 80%.",
    "eidolon4Image": "lib/images/edions/Huohuo_Rank_4.png",
    "eidolon5": "Mandated by Edict, Evils Evicted\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Huohuo_Rank_5.png",
    "eidolon6": "Woven Together, Cohere Forever\nWhen healing a target ally, increases the target ally's DMG dealt by 50% for 2 turn(s).",
    "eidolon6Image": "lib/images/edions/Huohuo_Rank_6.png",
    "ascension2": "Fearful to Act\nWhen battle starts, Huohuo gains Divine Provision, lasting for 1 turn(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_Huohuo_SkillTree1.png",
    "ascension4": "The Cursed One\nThe chance to resist Crowd Control Debuffs increases by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Huohuo_Ultra.png",
    "ascension6": "Stress Reaction to Horror\nWhen her Talent is triggered to heal allies, Huohuo regenerates 1 Energy.",
    "ascension6Image": "lib/images/skills/SkillIcon_Huohuo_SkillTree3.png"
  },
  {
    "name": "Jing Yuan",
    "path": "Erudition",
    "imagePath": "lib/images/characters/Jing Yuan.png",
    "element": "Ice",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/era.png",
    "basic": "Glistening Light\nSingle Target\nDeals Lightning DMG equal to 50% of Jing Yuan's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1204_Normal.png",
    "skill": "Rifting Zenith\nAoE ATK\nDeals Lightning DMG equal to 50% of Jing Yuan's ATK to all enemies and increases Lightning-Lord's Hits Per Action by 2 for the next turn.",
    "skillImage": "lib/images/skills/SkillIcon_1204_BP.png",
    "ultimate": "Lightbringer\nAoE ATK\nDeals Lightning DMG equal to 120% of Jing Yuan's ATK to all enemies and increases Lightning-Lord's Hits Per Action by 3 for the next turn.",
    "ultimateImage": "lib/images/skills/SkillIcon_1204_Ultra_on.png",
    "Technique": "Spirit Invocation\nEnhance\nAfter using Technique, at the start of the next battle, the Lightning-Lord's Hits Per Action in the first turn increases by 3.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1204_Maze.png",
    "Talent": "Prana Extirpated\nAoE ATK\nSummons Lightning-Lord at the start of the battle. Lightning-Lord has 60 base SPD and 3 base Hits Per Action. When the Lightning-Lord takes action, its hits are considered as follow-up attacks, with each hit dealing Lightning DMG equal to 33% of Jing Yuan's ATK to a single enemy, and enemies adjacent to it also receive Lightning DMG equal to 25% of the DMG dealt to the target enemy. The Lightning-Lord's Hits Per Action can reach a max of 10. Every time Lightning-Lord's Hits Per Action increases by 1, its SPD increases by 10. After the Lightning-Lord's action ends, its SPD and Hits Per Action return to their base values. When Jing Yuan is knocked down, the Lightning-Lord will disappear. When Jing Yuan is affected by Crowd Control debuff, the Lightning-Lord is unable to take action.",
    "TalentImage": "lib/images/skills/SkillIcon_1204_Passive.png",
    "eidolon1": "Slash, Seas Split\nWhen Lightning-Lord attacks, the DMG multiplier on enemies adjacent to the target enemy increases by an extra amount equal to 25% of the DMG multiplier against the target enemy.",
    "eidolon1Image": "lib/images/edions/Jing Yuan_Rank_1.png",
    "eidolon2": "Swing, Skies Squashed\nAfter Lightning-Lord takes action, DMG caused by Jing Yuan's Basic ATK, Skill, and Ultimate increases by 20% for 2 turn(s).",
    "eidolon2Image": "lib/images/edions/Jing Yuan_Rank_2.png",
    "eidolon3": "Strike, Suns Subdued\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Jing Yuan_Rank_3.png",
    "eidolon4": "Spin, Stars Sieged\nFor each hit performed by the Lightning-Lord when it takes action, Jing Yuan regenerates 2 Energy.",
    "eidolon4Image": "lib/images/edions/Jing Yuan_Rank_4.png",
    "eidolon5": "Stride, Spoils Seized\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Jing Yuan_Rank_5.png",
    "eidolon6": "Sweep, Souls Slain\nEach hit performed by the Lightning-Lord when it takes action will make the target enemy Vulnerable.\nWhile Vulnerable, enemies receive 12% more DMG until the end of the Lightning-Lord's current turn, stacking up to 3 time(s).",
    "eidolon6Image": "lib/images/edions/Jing Yuan_Rank_6.png",
    "ascension2": "Battalia Crush\nIf the Lightning-Lord's Hits Per Action is greater or equal to 6 in the next turn, its CRIT DMG increases by 25% for the next turn.",
    "ascension2Image": "lib/images/skills/SkillIcon_1204_Rank1.png",
    "ascension4": "Savant Providence\nAt the start of the battle, immediately regenerates 15 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_1204_Rank2.png",
    "ascension6": "War Marshal\nAfter using Skill, CRIT Rate increases by 10% for 2 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_1204_BP.png"
  },
  {
    "name": "Jingliu",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Jingliu.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Lucent Moonglow\nSingle Target\nDeals Ice DMG equal to 50% of Jingliu's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Jingliu_Normal.png",
    "skill": "Transcendent Flash\nSingle Target\nSingle Target\nDeals Ice DMG equal to 100% of Jingliu's ATK to a single enemy and obtains 1 stack(s) of Syzygy.\n\nBlast\nDeals Ice DMG equal to 125% of Jingliu's ATK to a single enemy, and deals Ice DMG equal to 62.5% of Jingliu's ATK to adjacent enemies. Consumes 1 stack(s) of Syzygy. Using this ability does not consume Skill Points.",
    "skillImage": "lib/images/skills/SkillIcon_Jingliu_BP.png",
    "ultimate": "Florephemeral Dreamflux\nBlast\nDeals Ice DMG equal to 180% of Jingliu's ATK to a single enemy, and deals Ice DMG equal to 90% of Jingliu's ATK to any adjacent enemies. Gains 1 stack(s) of Syzygy after attack ends.",
    "ultimateImage": "lib/images/skills/SkillIcon_Jingliu_Ultra_on.png",
    "Technique": "Shine of Truth\nImpair\nAfter using this Technique, creates a dimension around Jingliu that lasts for 20 seconds, and all enemies in this dimension will become Frozen. After entering combat with enemies in the dimension, Jingliu immediately regenerates 15 Energy and obtains 1 stack(s) of Syzygy, with a 100% base chance of Freezing enemy targets for 1 turn(s). While Frozen, enemy targets cannot take action, and receive Ice Additional DMG equal to 80% of Jingliu's ATK at the start of every turn. Only 1 dimension created by allies can exist at the same time.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Jingliu_Maze.png",
    "Talent": "Crescent Transmigration\nEnhance\nWhen Jingliu has 2 stack(s) of Syzygy, she enters the Spectral Transmigration state with her Action Advanced by 100% and her CRIT Rate increases by 40%. Then, Jingliu's Skill \"Transcendent Flash\" becomes enhanced and turns into \"Moon On Glacial River,\" and becomes the only ability she can use in battle. When Jingliu uses an attack in the Spectral Transmigration state, she consumes HP from all other allies equal to 4% of their respective Max HP (this cannot reduce allies' HP to lower than 1). Jingliu's ATK increases by 540% of the total HP consumed from all allies in this attack, capped at 90% of her base ATK, lasting until the current attack ends. Jingliu cannot enter the Spectral Transmigration state again until the current Spectral Transmigration state ends. Syzygy can stack up to 3 times. When Syzygy stacks become 0, Jingliu will exit the Spectral Transmigration state.",
    "TalentImage": "lib/images/skills/SkillIcon_Jingliu_Passive.png",
    "eidolon1": "Moon Crashes Tianguan Gate\nWhen using her Ultimate or Enhanced Skill, Jingliu's CRIT DMG increases by 24% for 1 turn(s). If only one enemy target is attacked, the target will additionally be dealt Ice DMG equal to 100% of Jingliu's ATK.",
    "eidolon1Image": "lib/images/edions/Jingliu_Rank_1.png",
    "eidolon2": "Crescent Shadows Qixing Dipper\nAfter using Ultimate, increases the DMG of the next Enhanced Skill by 80%.",
    "eidolon2Image": "lib/images/edions/Jingliu_Rank_2.png",
    "eidolon3": "Halfmoon Gapes Mercurial Haze\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Jingliu_Rank_3.png",
    "eidolon4": "Lunarlance Shines Skyward Dome\nDuring the Spectral Transmigration state, the ATK gained from consuming allies' HP is additionally increased by 90% of the total HP consumed from the entire team. The cap for ATK gained this way also increases by 30%.",
    "eidolon4Image": "lib/images/edions/Jingliu_Rank_4.png",
    "eidolon5": "Night Shades Astral Radiance\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Jingliu_Rank_5.png",
    "eidolon6": "Eclipse Hollows Corporeal Husk\nWhen Jingliu enters the Spectral Transmigration state, the Syzygy stack limit increases by 1, and Jingliu obtains 1 stack(s) of Syzygy. While she is in the Spectral Transmigration state, her CRIT DMG increases by 50%.",
    "eidolon6Image": "lib/images/edions/Jingliu_Rank_6.png",
    "ascension2": "Deathrealm\nWhile in the Spectral Transmigration state, increases Effect RES by 35%.",
    "ascension2Image": "lib/images/skills/SkillIcon_3005_Rank1.png",
    "ascension4": "Sword Champion\nAfter using Transcendent Flash, the next action will be Advanced Forward by 10%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Jingliu_SkillTree2.png",
    "ascension6": "Frost Wraith\nWhile in the Spectral Transmigration state, increases Ultimate DMG by 20%.",
    "ascension6Image": "lib/images/skills/SkillIcon_3005_Ultra.png"
  },
  {
    "name": "Luka",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Luka.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Direct Punch\nSingle Target\nSingle Target\nDeals Physical DMG equal to 50% of Luka's ATK to a single enemy.\n\nSingle Target\nConsumes 2 stacks of Fighting Will. First, uses Direct Punch to deal 3 hits, with each hit dealing Physical DMG equal to 10% of Luka's ATK to a single enemy target.\nThen, uses Rising Uppercut to deal 1 hit, dealing Physical DMG equal to 40% of Luka's ATK to the single enemy target.",
    "basicImage": "lib/images/skills/SkillIcon_Luka_Normal.png",
    "skill": "Lacerating Fist\nSingle Target\nDeals Physical DMG equal to 60% of Luka's ATK to a single enemy target. In addition, there is a 100% base chance to inflict Bleed on them, lasting for 3 turn(s).\nWhile Bleeding, the enemy will take 24% of their Max HP as Physical DoT at the start of each turn. This DMG will not exceed more than 130% of Luka's ATK.",
    "skillImage": "lib/images/skills/SkillIcon_Luka_BP.png",
    "ultimate": "Coup de Grâce\nSingle Target\nReceives 2 stack(s) of Fighting Will, with a 100% base chance to increase a single enemy target's DMG received by 12% for 3 turn(s). Then, deals Physical DMG equal to 198% of Luka's ATK to the target.",
    "ultimateImage": "lib/images/skills/SkillIcon_Luka_Ultra_on.png",
    "Technique": "Anticipator\nImmediately attacks the enemy. Upon entering battle, Luka deals Physical DMG equal to 50% of his ATK to a random single enemy with a 100% base chance to inflict his Skill's Bleed effect on the target. Then, Luka gains 1 additional stack of Fighting Will.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Luka_Maze.png",
    "Talent": "Flying Sparks\nEnhance\nAfter Luka uses his Basic ATK \"Direct Punch\" or Skill \"Lacerating Fist,\" he receives 1 stack(s) of Fighting Will, up to 4 stacks. When he has 2 or more stacks of Fighting Will, his Basic ATK \"Direct Punch\" is enhanced to \"Sky-Shatter Fist.\" After his Enhanced Basic ATK's \"Rising Uppercut\" hits a Bleeding enemy target, the Bleed status will immediately deal DMG for 1 time equal to 68% of the original DMG to the target. At the start of battle, Luka will possess 1 stack of Fighting Will.",
    "TalentImage": "lib/images/skills/SkillIcon_Luka_Passive.png",
    "eidolon1": "Fighting Endlessly\nWhen Luka takes action, if the target enemy is Bleeding, increases DMG dealt by Luka by 15% for 2 turn(s).",
    "eidolon1Image": "lib/images/edions/Luka_Rank_1.png",
    "eidolon2": "The Enemy is Weak, I am Strong\nIf the Skill hits an enemy target with Physical Weakness, gain 1 stack(s) of Fighting Will.",
    "eidolon2Image": "lib/images/edions/Luka_Rank_2.png",
    "eidolon3": "Born for the Ring\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Luka_Rank_3.png",
    "eidolon4": "Never Turning Back\nFor every stack of Fighting Will obtained, increases ATK by 5%, stacking up to 4 time(s).",
    "eidolon4Image": "lib/images/edions/Luka_Rank_4.png",
    "eidolon5": "The Spirit of Wildfire\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Luka_Rank_5.png",
    "eidolon6": "A Champion's Applause\nAfter the Enhanced Basic ATK's \"Rising Uppercut\" hits a Bleeding enemy target, the Bleed status will immediately deal DMG 1 time equal to 8% of the original DMG for every hit of Direct Punch already unleashed during the current Enhanced Basic ATK.",
    "eidolon6Image": "lib/images/edions/Luka_Rank_6.png",
    "ascension2": "Kinetic Overload\nWhen the Skill is used, immediately dispels 1 buff from the enemy target.",
    "ascension2Image": "lib/images/skills/SkillIcon_Luka_Rank1.png",
    "ascension4": "Cycle Braking\nFor every stack of Fighting Will obtained, additionally regenerates 3 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_Luka_Rank2.png",
    "ascension6": "Crush Fighting Will\nWhen using Enhanced Basic ATK, every hit Direct Punch deals has a 50% fixed chance for Luka to use 1 additional hit. This effect does not apply to additional hits generated in this way.",
    "ascension6Image": "lib/images/skills/SkillIcon_Luka_SkillTree3.png"
  },
  {
    "name": "Luocha",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Luocha.png",
    "element": "Imaginary",
    "elementImage": "lib/images/imaginary.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Thorns of the Abyss\nSingle Target\nDeals Imaginary DMG equal to 50% of Luocha's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1203_Normal.png",
    "skill": "Prayer of Abyss Flower\nRestore\nAfter using his Skill, Luocha immediately restores the target ally's HP equal to 40% of Luocha's ATK plus 200. Meanwhile, Luocha gains 1 stack of Abyss Flower.\nWhen any ally's HP percentage drops to 50% or lower, an effect equivalent to Luocha's Skill will immediately be triggered and applied to this ally for one time (without consuming Skill Points). This effect can be triggered again after 2 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_1203_BP.png",
    "ultimate": "Death Wish\nAoE ATK\nRemoves 1 buff(s) from all enemies and deals Imaginary DMG equal to 120% of Luocha's ATK to all enemies. Luocha gains 1 stack of Abyss Flower.",
    "ultimateImage": "lib/images/skills/SkillIcon_1203_Ultra_on.png",
    "Technique": "Mercy of a Fool\nRestore\nAfter the Technique is used, the Talent will be immediately triggered at the start of the next battle.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1203_Maze.png",
    "Talent": "Cycle of Life\nRestore\nWhen Abyss Flower reaches 2 stacks, Luocha consumes all stacks of Abyss Flower to deploy a Field against the enemy.\nWhen any enemy in the Field is attacked by an ally, the attacking ally's HP is immediately restored by an amount equal to 12% of Luocha's ATK plus 60.\nThe Field's effect lasts for 2 turns. When Luocha is knocked down, the Field will be dispelled.",
    "TalentImage": "lib/images/skills/SkillIcon_1203_Passive.png",
    "eidolon1": "Ablution of the Quick\nWhile the Field is active, ATK of all allies increases by 20%.",
    "eidolon1Image": "lib/images/edions/Luka_Rank_1.png",
    "eidolon2": "Bestowal From the Pure\nWhen his Skill is triggered, if the target ally's HP is lower than 50%, Luocha's Outgoing Healing increases by 30%. If the target ally's HP is at 50% or higher, the ally receives a Shield that can absorb DMG equal to 18% of Luocha's ATK plus 240, lasting for 2 turns.",
    "eidolon2Image": "lib/images/edions/Luka_Rank_2.png",
    "eidolon3": "Surveyal by the Fool\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Luka_Rank_3.png",
    "eidolon4": "Heavy Lies the Crown\nWhen Luocha's Field is active, enemies become Weakened and deal 12% less DMG.",
    "eidolon4Image": "lib/images/edions/Luka_Rank_4.png",
    "eidolon5": "Cicatrix 'Neath the Pain\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Luka_Rank_5.png",
    "eidolon6": "Reunion With the Dust\nWhen Ultimate is used, there is a 100% fixed chance to reduce all enemies' All-Type RES by 20% for 2 turn(s).",
    "eidolon6Image": "lib/images/edions/Luka_Rank_6.png",
    "ascension2": "Sanctified\nWhen any enemy in the Field is attacked by an ally, all allies (except the attacker) restore HP equal to 7% of Luocha's ATK plus 93.",
    "ascension2Image": "lib/images/skills/SkillIcon_1203_Rank1.png",
    "ascension4": "Through the Valley\nThe chance to resist Crowd Control debuffs increases by 70%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1203_Rank2.png",
    "ascension6": "Cleansing Revival\nWhen the Skill's effect is triggered, removes 1 debuff(s) from a target ally.",
    "ascension6Image": "lib/images/skills/SkillIcon_1203_BP.png"
  },
  {
    "name": "Lynx",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Lynx.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Ice Crampon Technique\nSingle Target\nDeals Quantum DMG equal to 25% of this character's Max HP to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Lynx_Normal.png",
    "skill": "Salted Camping Cans\nRestore\nApplies \"Survival Response\" to a single target ally and increases their Max HP by 5% of Lynx's Max HP plus 50. If the target ally is a character on the Path of Destruction or Preservation, the chance of them being attacked by enemies will greatly increase. \"Survival Response\" lasts for 2 turn(s).\nRestores the target's HP by 8% of Lynx's Max HP plus 80.",
    "skillImage": "lib/images/skills/SkillIcon_Lynx_BP.png",
    "ultimate": "Snowfield First Aid\nRestore\nDispels 1 debuff(s) from all allies and immediately restores their respective HP by an amount equal to 9% of Lynx's Max HP plus 90.",
    "ultimateImage": "lib/images/skills/SkillIcon_Lynx_Ultra_on.png",
    "Technique": "Chocolate Energy Bar\nRestore\nAfter Lynx uses her Technique, at the start of the next battle, all allies are granted her Talent's continuous healing effect, lasting for 2 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_Lynx_Maze.png",
    "Talent": "Outdoor Survival Experience\nRestore\nWhen using Lynx's Skill or Ultimate, applies continuous healing to the target ally for 2 turn(s), restoring the target ally's HP by an amount equal to 2.4% of Lynx's Max HP plus 24 at the start of each their turn. If the target has \"Survival Response\", the continuous healing effect additionally restores HP by an amount equal to 3% of Lynx's Max HP plus 30.",
    "TalentImage": "lib/images/skills/SkillIcon_Lynx_Passive.png",
    "eidolon1": "Morning of Snow Hike\nWhen healing allies with HP equal to or lower than 50%, Lynx's Outgoing Healing increases by 20%. This effect also works on continuous healing.",
    "eidolon1Image": "lib/images/edions/Lynx_Rank_1.png",
    "eidolon2": "Noon of Portable Furnace\nA target with \"Survival Response\" can resist debuff application for 1 time(s).",
    "eidolon2Image": "lib/images/edions/Lynx_Rank_2.png",
    "eidolon3": "Afternoon of Avalanche Beacon\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Lynx_Rank_3.png",
    "eidolon4": "Dusk of Warm Campfire\nWhen \"Survival Response\" is gained, increases the target's ATK by an amount equal to 3% of Lynx's Max HP for 1 turn(s).",
    "eidolon4Image": "lib/images/edions/Lynx_Rank_4.png",
    "eidolon5": "Night of Aurora Tea\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Lynx_Rank_5.png",
    "eidolon6": "Dawn of Explorers' Chart\nAdditionally boosts the Max HP increasing effect of \"Survival Response\" by an amount equal to 6% of Lynx's Max HP and increases Effect RES by 30%.",
    "eidolon6Image": "lib/images/edions/Lynx_Rank_6.png",
    "ascension2": "Advance Surveying\nAfter a target with \"Survival Response\" is hit, Lynx regenerates 2 Energy immediately.",
    "ascension2Image": "lib/images/skills/SkillIcon_Lynx_SkillTree1.png",
    "ascension4": "Exploration Techniques\nIncreases the chance to resist Crowd Control debuffs by 35%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Lynx_SkillTree2.png",
    "ascension6": "Survival in the Extreme\nExtends the duration of the continuous healing effect granted by Talent for 1 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_Lynx_SkillTree3.png"
  },
  {
    "name": "March 7th",
    "path": "Preservation",
    "imagePath": "lib/images/characters/March 7th.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/skills/SkillIcon_March_Normal.png",
    "basic": "Frigid Cold Arrow\nSingle Target\nDeals Ice DMG equal to 50% of March 7th's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_March_Ultra_on.png",
    "skill": "The Power of Cuteness\nDefense\nProvides a single ally with a Shield that can absorb DMG equal to 38% of March 7th's DEF plus 190 for 3 turn(s).\nIf the ally's HP is 30% of their Max HP or higher, greatly increases the chance of enemies attacking that ally.",
    "skillImage": "lib/images/skills/SkillIcon_March_BP.png",
    "ultimate": "Glacial Cascade\nAoE ATK\nDeals Ice DMG equal to 90% of March 7th's ATK to all enemies. Hit enemies have a 50% base chance to be Frozen for 1 turn(s). While Frozen, the enemy cannot take action and will receive Additional Ice DMG equal to 30% of March 7th's ATK at the beginning of each turn.",
    "ultimateImage": "lib/images/skills/SkillIcon_March_Ultra_on.png",
    "Technique": "Freezing Beauty\nImmediately attacks the enemy.\nAfter entering battle, there is a 100% base chance to Freeze a random enemy for 1 turn(s). While Frozen, the enemy cannot move and will take Ice DMG equal to 50% of March 7th's ATK at the beginning of each turn.",
    "TechniqueImage": "lib/images/skills/SkillIcon_March_Maze.png",
    "Talent": "Girl Power\nSingle Target\nAfter a shielded ally is attacked by an enemy, March 7th immediately Counters, dealing Ice DMG equal to 50% of her ATK.\nThis effect can be triggered 2 time(s) each turn.",
    "TalentImage": "lib/images/skills/SkillIcon_March_Passive.png",
    "eidolon1": "Memory of You\nEvery time March 7th's Ultimate Freeze a target, she regenerates 6 Energy.",
    "eidolon1Image": "lib/images/edions/March 7th_Rank_1.png",
    "eidolon2": "Memory of It\nUpon entering battle, grants a Shield equal to 24% of March 7th's DEF plus 320 to the ally with the lowest HP percentage, lasting for 3 turn(s).",
    "eidolon2Image": "lib/images/edions/March 7th_Rank_2.png",
    "eidolon3": "Memory of Everything\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/March 7th_Rank_3.png",
    "eidolon4": "Never Forfeit Again\nThe Talent's Counter effect can be triggered 1 more time in each turn. The DMG dealt by Counter increases by an amount that is equal to 30% of March 7th's DEF.",
    "eidolon4Image": "lib/images/edions/March 7th_Rank_4.png",
    "eidolon5": "Never Forget Again\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/March 7th_Rank_5.png",
    "eidolon6": "Just Like This, Always...\nAllies under the protection of the Shield granted by the Skill restores HP equal to 4% of their Max HP plus 106 at the beginning of each turn.",
    "eidolon6Image": "lib/images/edions/March 7th_Rank_6.png",
    "ascension2": "Purify\nSkill removes 1 debuff from an ally.",
    "ascension2Image": "lib/images/skills/SkillIcon_March_Rank1.png",
    "ascension4": "Reinforce\nThe duration of the Shield generated from Skill is extended for 1 turn(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_March_Rank2.png",
    "ascension6": "Ice Spell\nIncreases Ultimate's base chance to Freeze enemies by 15%.",
    "ascension6Image": "lib/images/skills/SkillIcon_March_Ultra.png"
  },
  {
    "name": "Misha",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Misha.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/dest.png",
    "basic": "E—Excuse Me, Please!\nSingle Target\nDeals Ice DMG equal to 50% of Misha's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Misha_Normal.png",
    "skill": "R—Room Service\nBlast\nIncreases the Hits Per Action for Misha's next Ultimate by 1 hit(s). Deals Ice DMG equal to 100% of Misha's ATK to a single target enemy, and Ice DMG equal to 40% of Misha's ATK to adjacent targets.",
    "skillImage": "lib/images/skills/SkillIcon_Misha_BP.png",
    "ultimate": "G—Gonna Be Late!\nBounce\nHas 3 Hits Per Action by default. First, uses 1 hit to deal Ice DMG equal to 36% of Misha's ATK to a single target enemy. Then, the rest of the hits each deals Ice DMG equal to 36% of Misha's ATK to a single random enemy. Just before each hit lands, there is a 12% base chance to Freeze the target, lasting for 1 turn.\nWhile Frozen, enemy targets cannot take any actions, and at the start of their turn, they receive Additional Ice DMG equal to 18% of Misha's ATK.\nThis Ultimate can possess up to 10 Hits Per Action. After the Ultimate is used, its Hits Per Action will be reset to the default level.",
    "ultimateImage": "lib/images/skills/SkillIcon_Misha_Ultra_on.png",
    "Technique": "Wait, You Are So Beautiful!\nImpair\nAfter using the Technique, creates a dimension that lasts for 15 seconds. Enemies caught in the dimension are inflicted with Dream Prison and stop all their actions. Upon entering battle against enemies afflicted with Dream Prison, increases the Hits Per Action for Misha's next Ultimate by 2 hit(s). Only 1 dimension created by allies can exist at the same time.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Misha_Maze.pngg",
    "Talent": "Horological Escapement\nEnhance\nWhenever any ally consumes 1 Skill Point, Misha's next Ultimate delivers 1 more Hit(s) Per Action and Misha regenerates 1 Energy.",
    "TalentImage": "lib/images/skills/SkillIcon_Misha_Passive.png",
    "eidolon1": "Whimsicality of Fancy\nWhen using the Ultimate, for every enemy on the field, additionally increases the Hits Per Action for the Ultimate by 1 hit(s), up to a maximum increase of 5 hit(s).",
    "eidolon1Image": "lib/images/edions/Misha_Rank_1.png",
    "eidolon2": "Yearning of Youth\nBefore each hit of the Ultimate lands, there is a 24% base chance of reducing the target's DEF by 16% for 3 turn(s).",
    "eidolon2Image": "lib/images/edions/Misha_Rank_2.png",
    "eidolon3": "Vestige of Happiness\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Misha_Rank_3.png",
    "eidolon4": "Visage of Kinship\nIncreases the DMG multiplier for each hit of the Ultimate by 6%.",
    "eidolon4Image": "lib/images/edions/Misha_Rank_4.png",
    "eidolon5": "Genesis of First Love\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Misha_Rank_5.png",
    "eidolon6": "Estrangement of Dream\nWhen using the Ultimate, increases own DMG by 30%, lasting until the end of the turn. In addition, the next time the Skill is used, recovers 1 Skill Point(s) for the team.",
    "eidolon6Image": "lib/images/edions/Misha_Rank_6.png",
    "ascension2": "Release\nBefore the Ultimate's first hit lands, increases the base chance of Freezing the target by 80%.",
    "ascension2Image": "lib/images/skills/SkillIcon_Misha_SkillTree1.png",
    "ascension4": "Interlock\nWhen using the Ultimate, increases the Effect Hit Rate by 60%, lasting until the end of the Ultimate's current action.",
    "ascension4Image": "lib/images/skills/SkillIcon_Misha_SkillTree2.png",
    "ascension6": "Transmission\nWhen dealing DMG to Frozen enemies, increases CRIT DMG by 30%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Misha_SkillTree3.png"
  },
  {
    "name": "Natasha",
    "path": "Abundance",
    "imagePath": "lib/images/characters/Natasha.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/abun.png",
    "basic": "Behind the Kindness\nSingle Target\nDeals Physical DMG equal to 50% of Natasha's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1105_Normal.png",
    "skill": "Love, Heal, and Choose\nRestore\nRestores a single ally for 7% of Natasha's Max HP plus 70.\nRestores the ally for another 4.8% of Natasha's Max HP plus 48 at the beginning of each turn for 2 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_1105_BP.png",
    "ultimate": "Gift of Rebirth\nRestore\nHeals all allies for 9.2% of Natasha's Max HP plus 92.",
    "ultimateImage": "lib/images/skills/SkillIcon_1105_Ultra_on.png",
    "Technique": "Hypnosis Research\nImmediately attacks the enemy. After entering battle, deals Physical DMG equal to 80% of Natasha's ATK to a random enemy, with a 100% base chance to Weaken all enemies.\nWhile Weakened, enemies deal 30% less DMG to allies for 1 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_1105_Maze.png",
    "Talent": "Innervation\nRestore\nWhen healing allies with HP percentage at 30% or lower, increases Natasha's Outgoing Healing by 25%.\nThis effect also works on continuous healing.",
    "TalentImage": "lib/images/skills/SkillIcon_1105_Passive.png",
    "eidolon1": "Phamacology Expertise\nAfter being attacked, if the current HP percentage is 30% or lower, heals self for 1 time to restore HP by an amount equal to 15% of Max HP plus 400.\nThis effect can only be triggered 1 time per battle.",
    "eidolon1Image": "lib/images/edions/Natasha_Rank_1.png",
    "eidolon2": "Clinical Research\nWhen Natasha uses her Ultimate, grant continuous healing for 1 turn(s) to allies whose HP is at 30% or lower.\nAnd at the beginning of their turn, their HP is restored by an amount equal to 6% of Natasha's Max HP plus 160.",
    "eidolon2Image": "lib/images/edions/Natasha_Rank_2.png",
    "eidolon3": "The Right Cure\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Natasha_Rank_3.png",
    "eidolon4": "Miracle Cure\nAfter being attacked, regenerates 5 extra Energy.",
    "eidolon4Image": "lib/images/edions/Natasha_Rank_4.png",
    "eidolon5": "Preventive Treatment\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Natasha_Rank_5.png",
    "eidolon6": "Doctor's Grace\nNatasha's Basic ATK additionally deals Physical DMG equal to 40% of her Max HP.",
    "eidolon6Image": "lib/images/edions/Natasha_Rank_6.png",
    "ascension2": "Soothe\nThe Skill removes 1 debuff(s) from a target ally.",
    "ascension2Image": "lib/images/skills/SkillIcon_1105_Rank1.png",
    "ascension4": "Healer\nNatasha's Outgoing Healing increases by 10%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1105_Rank2.png",
    "ascension6": "Recuperation\nIncreases the duration of her Skill's continuous healing effect for 1 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_1105_BP.png"
  },
  {
    "name": "Pela",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Pela.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Frost Shot\nSingle Target\nDeals Ice DMG equal to 50% of Pela's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1106_Normal.png",
    "skill": "Frostbite\nImpair\nRemoves 1 buff(s) and deals Ice DMG equal to 105% of Pela's ATK to a single target enemy.",
    "skillImage": "lib/images/skills/SkillIcon_1106_BP.png",
    "ultimate": "Zone Suppression\nImpair\nDeals Ice DMG equal to 60% of Pela's ATK to all enemies, with a 100% base chance to inflict Exposed on all enemies.\nWhen Exposed, enemies' DEF is reduced by 30% for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1206_Ultra_on.png",
    "Technique": "Data Collecting\nSupport\nIf the enemy is debuffed after Pela's attack, Pela will restore 5 extra Energy.\nThis effect can only be triggered 1 time per attack.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1106_Maze.png",
    "Talent": "Preemptive Strike\nImmediately attacks the enemy.\nUpon entering battle, Pela deals Ice DMG equal to 80% of her ATK to a random enemy, with a 100% base chance of lowering the DEF of all enemies by 20% for 2 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_1106_Passive.png",
    "eidolon1": "Victory Report\nWhen Pela defeats an enemy, Pela regenerates 5 Energy.",
    "eidolon1Image": "lib/images/edions/Pela_Rank_1.png",
    "eidolon2": "Adamant Charge\nUsing Skill to remove buff(s) increases SPD by 10% for 2 turn(s).",
    "eidolon2Image": "lib/images/edions/Pela_Rank_2.png",
    "eidolon3": "Suppresive Force\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Pela_Rank_3.png",
    "eidolon4": "Full Analysis\nWhen using Skill, there is a 100% base chance to reduce the target enemy's Ice RES by 12% for 2 turn(s).",
    "eidolon4Image": "lib/images/edions/Pela_Rank_4.png",
    "eidolon5": "Absolute Jeopardy\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Pela_Rank_5.png",
    "eidolon6": "Feeble Pursuit\nWhen Pela attacks a debuffed enemy, she deals Additional Ice DMG equal to 40% of Pela's ATK to the enemy.",
    "eidolon6Image": "lib/images/edions/Pela_Rank_6.png",
    "ascension2": "Bash\nPela deals 20% more DMG to debuffed enemies.",
    "ascension2Image": "lib/images/skills/SkillIcon_1106_Rank1.png",
    "ascension4": "The Secret Strategy\nWhen Pela is on the battlefield, all allies' Effect Hit Rate increases by 10%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1106_Rank2.png",
    "ascension6": "Wipe Out\nUsing Skill to remove buff(s) increases the DMG of the next attack by 20%.",
    "ascension6Image": "lib/images/skills/SkillIcon_1106_BP.png"
  },
  {
    "name": "Qingque",
    "path": "Erudition",
    "imagePath": "lib/images/characters/QingQue.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/era.png",
    "basic": "Flower Pick\nSingle Target\nTosses 1 jade tile of the suit with the fewest tiles in hand to deal Quantum DMG equal to 50% of Qingque's ATK to a single enemy.\n\nCherry on Top!: Deals Quantum DMG equal to 120% of Qingque's ATK to a single enemy, and deals Quantum DMG equal to 50% of Qingque's ATK to enemies adjacent to it. \"Cherry on Top!\" cannot recover Skill Points.",
    "basicImage": "lib/images/skills/SkillIcon_1201_Normal.png",
    "skill": "A Scoop of Moon\nEnhance\nImmediately draws 2 jade tile(s) and increases DMG by 14% until the end of the current turn.\nThis effect may be stacked up to 4 time(s). The turn will not end after this Skill is used.",
    "skillImage": "lib/images/skills/SkillIcon_1201_BP.png",
    "ultimate": "A Quartet? Woo-hoo!\nAoE ATK\nDeals Quantum DMG equal to 120% of Qingque's ATK to all enemies, and obtain 4 jade tiles of the same suit.",
    "ultimateImage": "lib/images/skills/SkillIcon_1201_Ultra_on.png",
    "Technique": "Game Solitaire\nEnhance\nAfter using Technique, Qingque draws 2 jade tile(s) when the battle starts.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1201_Maze.png",
    "Talent": "Celestial Jade\nEnhance\nWhen an ally's turn starts, Qingque randomly draws 1 tile from 3 different suits and can hold up to 4 tiles at one time.\nIf Qingque starts her turn with 4 tiles of the same suit, she consumes all tiles to enter the \"Hidden Hand\" state.\nWhile in this state, Qingque cannot use her Skill again. At the same time, Qingque's ATK increased by 36% and her Basic ATK \"Flower Pick\" is enhanced, becoming \"Cherry on Top!\". The \"Hidden Hand\" state ends after using \"Cherry onn Top!\".",
    "TalentImage": "lib/images/skills/SkillIcon_1201_Passive.png",
    "eidolon1": "Rise Through the Tiles\nUltimate deals 10% more DMG.",
    "eidolon1Image": "lib/images/edions/QingQue_Rank_1.png",
    "eidolon2": "Sleep on the Tiles\nEvery time Draw Tile is triggered, Qingque immediately regenerates 1 Energy.",
    "eidolon2Image": "lib/images/edions/QingQue_Rank_1.png",
    "eidolon3": "Read Between the Tiles\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/QingQue_Rank_1.png",
    "eidolon4": "Right on the Tiles\nAfter this character's Skill is used, there is a 24% fixed chance to gain Autarky, which lasts until the end of the current turn.\n\nWith Autarky, using Basic ATK or Enhanced Basic ATK immediately launches 1 follow-up attack on the same target, dealing Quantum DMG equal to 100% of the previous Basic ATK (or Enhanced Basic ATK)'s DMG.",
    "eidolon4Image": "lib/images/edions/QingQue_Rank_1.png",
    "eidolon5": "Gambit for the Tiles\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/QingQue_Rank_1.png",
    "eidolon6": "Prevail Beyond the Tiles\nRecovers 1 Skill Point after using Enhanced Basic ATK.",
    "eidolon6Image": "lib/images/edions/QingQue_Rank_1.png",
    "ascension2": "Tile Battle\nRestores 1 Skill Point when using the Skill. This effect can only be triggered 1 time per battle.",
    "ascension2Image": "lib/images/skills/SkillIcon_1201_Rank1.png",
    "ascension4": "Bide Time\nUsing the Skill increases DMG Boost effect of attacks by an extra 10%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1201_Rank2.png",
    "ascension6": "Winning Hand\nQingque's SPD increases by 10% for 1 turn after using the Enhanced Basic ATK.",
    "ascension6Image": "lib/images/skills/SkillIcon_1201_Ultra.png"
  },
  {
    "name": "Sampo",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Sampo.png",
    "element": "Wind",
    "elementImage": "lib/images/wind.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Dazzling Blades\nSingle Target\nDeals Wind DMG equal to 50% of Sampo's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1108_Normal.png",
    "skill": "Ricochet Love\nBounce\nDeals Wind DMG equal to 28% of Sampo's ATK to a single enemy, and further deals DMG for 4 extra time(s), with each time dealing Wind DMG equal to 28% of Sampo's ATK to a random enemy.",
    "skillImage": "lib/images/skills/SkillIcon_1108_BP.png",
    "ultimate": "Surprise Present\nImpair\nDeals Wind DMG equal to 96% of Sampo's ATK to all enemies, with a 100% base chance to increase the targets' DoT taken by 20% for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1108_Ultra_on.png",
    "Technique": "Shining Bright\nImpair\nAfter Sampo uses his Technique, enemies in a set area are inflicted with Blind for 10 second(s).\nBlinded enemies cannot detect your team.\nWhen initiating combat against a Blinded enemy, there is a 100% fixed chance to delay all enemies' action by 25%.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1108_Maze.png",
    "Talent": "Windtorn Dagger\nImpair\nSampo's attacks have a 65% base chance to inflict Wind Shear for 3 turn(s).\nEnemies inflicted with Wind Shear will take Wind DoT equal to 20% of Sampo's ATK at the beginning of each turn.\nWind Shear can stack up to 5 time(s).",
    "TalentImage": "lib/images/skills/SkillIcon_1108_Passive.png",
    "eidolon1": "Rising Love\nWhen using Skill, deals DMG for 1 extra time(s) to a random enemy.",
    "eidolon1Image": "lib/images/edions/Sampo_Rank_1.png",
    "eidolon2": "Infectious Enthusiasm\nDefeating an enemy with Wind Shear has a 100% base chance to inflict all enemies with 1 stack(s) of Wind Shear, equivalent to the Talent's Wind Shear.",
    "eidolon2Image": "lib/images/edions/Sampo_Rank_2.png",
    "eidolon3": "Big Money!\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Sampo_Rank_3.png",
    "eidolon4": "The Deeper the Love, the Stronger the Hate\nWhen Skill hits an enemy with 5 or more stack(s) of Wind Shear, the enemy immediately takes 8% of current Wind Shear DMG.",
    "eidolon4Image": "lib/images/edions/Sampo_Rank_4.png",
    "eidolon5": "Huuuuge Money!\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Sampo_Rank_5.png",
    "eidolon6": "Increased Spending\nTalent's Wind Shear DMG multiplier increases by 15%.",
    "eidolon6Image": "lib/images/edions/Sampo_Rank_6.png",
    "ascension2": "Trap\nExtends the duration of Wind Shear caused by Talent by 1 turn(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_1108_Rank1.png",
    "ascension4": "Defensive Position\nUsing Ultimate additionally regenerates 10 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_1108_Rank2.png",
    "ascension6": "Spice Up\nEnemies with Wind Shear effect deal 15% less DMG to Sampo.",
    "ascension6Image": "lib/images/skills/SkillIcon_1108_Ultra.png"
  },
  {
    "name": "Seele",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Seele.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Thwack\nSingle Target\nDeals Quantum DMG equal to 50% of Seele's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1102_Normal.png",
    "skill": "Sheathed Blade\nSingle Target\nIncreases Seele's SPD by 25% for 2 turn(s) and deals Quantum DMG equal to 110% of Seele's ATK to a single enemy.",
    "skillImage": "lib/images/skills/SkillIcon_1102_BP.png",
    "ultimate": "Butterfly Flurry\nSingle Target\nSeele enters the buffed state and deals Quantum DMG equal to 255% of her ATK to a single enemy.",
    "ultimateImage": "lib/images/skills/SkillIcon_1102_Ultra_on.png",
    "Technique": "Phantom Illusion\nEnhance\nAfter using her Technique, Seele gains Stealth for 20 second(s). While Stealth is active, Seele cannot be detected by enemies.\nAnd when entering battle by attacking enemies, Seele will immediately enter the buffed state.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1102_Maze.png",
    "Talent": "Resurgence\nEnhance\nEnters the buffed state upon defeating an enemy with Basic ATK, Skill, or Ultimate, and receives an extra turn. While in the buffed state, the DMG of Seele's attacks increases by 40% for 1 turn(s). Enemies defeated in the extra turn provided by \"Resurgence\" will not trigger another \"Resurgence.\"\n\nExtirpating Slash: When dealing DMG to an enemy whose HP percentage is 80% or lower, CRIT Rate increases by 15%.",
    "TalentImage": "lib/images/skills/SkillIcon_1102_Passive.png",
    "eidolon1": "Exitrpating Slash\nWhen dealing DMG to an enemy whose HP percentage is 80% or lower, CRIT Rate increases by 15%.",
    "eidolon1Image": "lib/images/edions/Seele_Rank_1.png",
    "eidolon2": "Dancing Butterfly\nThe SPD Boost effect of Seele's Skill can stack up to 2 time(s).",
    "eidolon2Image": "lib/images/edions/Seele_Rank_2.png",
    "eidolon3": "Dazzling Tumult\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Seele_Rank_3.png",
    "eidolon4": "Flitting Phantasm\nSeele regenerates 15 Energy when she defeats an enemy.",
    "eidolon4Image": "lib/images/edions/Seele_Rank_4.png",
    "eidolon5": "Piercing Shards\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Seele_Rank_5.png",
    "eidolon6": "Shattering Shambles\nAfter Seele uses her Ultimate, inflict the target enemy with Butterfly Flurry for 1 turn(s). Enemies suffering from Butterfly Flurry will take Additional Quantum DMG equal to 15% of Seele's Ultimate DMG every time they are attacked. If the target enemy is defeated by the Butterfly Flurry DMG triggered by other allies' attacks, Seele's Talent will not be triggered.\nWhen Seele is knocked down, the Butterfly Flurry inflicted on the enemies will be removed.",
    "eidolon6Image": "lib/images/edions/Seele_Rank_6.png",
    "ascension2": "Nightshade\nWhen current HP percentage is 50% or lower, reduces the chance of being attacked by enemies.",
    "ascension2Image": "lib/images/skills/SkillIcon_1102_Rank1.png",
    "ascension4": "Rippling Waves\nAfter using a Basic ATK, Seele's next action will be Advanced Forward by 20%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1102_Rank2.png",
    "ascension6": "Lacerate\nWhile Seele is in the buffed state, her Quantum RES PEN increases by 20%.",
    "ascension6Image": "lib/images/skills/SkillIcon_1102_Ultra.png"
  },
  {
    "name": "Serval",
    "path": "Erudition",
    "imagePath": "lib/images/characters/Serval.png",
    "element": "Lightning",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/era.png",
    "basic": "Roaring Thunderclap\nSingle Target\nDeals Lightning DMG equal to 50% of Serval's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1103_Normal.png",
    "skill": "Lightning Flash\nBlast\nDeals Lightning DMG equal to 70% of Serval's ATK to a single enemy and Lightning DMG equal to 30% of Serval's ATK to enemies adjacent to it, with a 80% base chance for enemies hit to become Shocked for 2 turn(s).\nWhile Shocked, enemies take Lightning DoT equal to 40% of Serval's ATK at the beginning of each turn.",
    "skillImage": "lib/images/skills/SkillIcon_1103_BP.png",
    "ultimate": "Here Comes the Mechanical Fever\nAoE ATK\nDeals Lightning DMG equal to 108% of Serval's ATK to all enemies.\nEnemies already Shocked will extend the duration of their Shock state by 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1103_Ultra_on.png",
    "Technique": "Good Night, Belobog\nImmediately attacks the enemy.\nAfter entering battle, deals Lightning DMG equal to 50% of Serval's ATK to a random enemy, with a 100% base chance for all enemies to become Shocked for 3 turn(s).\nWhile Shocked, enemies will take Lightning DoT equal to 50% of Serval's ATK at the beginning of each turn.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1103_Maze.png",
    "Talent": "Galvanic Chords\nEnhance\nAfter Serval attacks, deals additional Lightning DMG equal to 36% of Serval's ATK to all Shocked enemies.",
    "TalentImage": "lib/images/skills/SkillIcon_1103_Passive.png",
    "eidolon1": "Echo Chamber\nBasic ATK deals Lightning DMG equal to 60% of the Basic ATK's DMG to a random enemy adjacent to the Basic ATK target.",
    "eidolon1Image": "lib/images/edions/Serval_Rank_1.png",
    "eidolon2": "Encore!\nEvery time Serval's Talent is triggered to deal additional DMG, she regenerates 4 Energy.\n\n",
    "eidolon2Image": "lib/images/edions/Serval_Rank_2.png",
    "eidolon3": "Listen, the Heartbeat of the Gears\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Serval_Rank_3.png",
    "eidolon4": "Make Some Noise!\nUltimate has a 100% base chance to apply Shock to any enemies not currently Shocked.\nThis Shock has the same effects as the one applied by Skill.",
    "eidolon4Image": "lib/images/edions/Serval_Rank_4.png",
    "eidolon5": "Belobog's Loudest Roar!\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Serval_Rank_5.png",
    "eidolon6": "This Song Rocks to Heaven!\nServal deals 30% more DMG to Shocked enemies.",
    "eidolon6Image": "lib/images/edions/Serval_Rank_6.png",
    "ascension2": "Rock 'n' Roll\nSkill has a 20% increased base chance to Shock enemies.",
    "ascension2Image": "lib/images/skills/SkillIcon_1103_Rank1.png",
    "ascension4": "String Vibration\nAt the start of the battle, immediately regenerates 15 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_1103_Rank2.png",
    "ascension6": "Mania\nUpon defeating an enemy, ATK is increasedd by 20% for 2 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_1103_Ultra.png"
  },
  {
    "name": "Silver Wolf",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Silver Wolf.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/nil.png",
    "basic": "System Warning\nSingle Target\nDeals Quantum DMG equal to 50% of Silver Wolf's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Silver_Normal.png",
    "skill": "Allow Changes?\nImpair\nThere is a 75% base chance to add 1 Weakness of an on-field ally's Type to the target enemy. This also reduces the enemy's DMG RES to that Weakness Type by 20% for 2 turn(s). If the enemy already has that Type Weakness, the effect of DMG RES reduction to that Weakness Type will not be triggered.\nEach enemy can only have 1 Weakness implanted by Silver Wolf. When Silver Wolf implants another Weakness to the target, only the most recent implanted Weakness will be kept.\nIn addition, there is a 100% base chance to reduce the All-Type RES of the enemy further by 7.5% for 2 turn(s).\nDeals Quantum DMG equal to 98% of Silver Wolf's ATK to this enemy.",
    "skillImage": "lib/images/skills/SkillIcon_Silver_BP.png",
    "ultimate": "User Banned\nImpair\nThere's a 85% base chance to decrease the target enemy's DEF by 36% for 3 turn(s). And at the same time, deals Quantum DMG equal to 228% of Silver Wolf's ATK to the target enemy.",
    "ultimateImage": "lib/images/skills/SkillIcon_Silver_Ultra_on.png",
    "Technique": "Force Quit Program\nImmediately attacks the enemy. After entering battle, deals Quantum DMG equal to 80% of Silver Wolf's ATK to all enemies, and ignores Weakness Types and reduces Toughness from all enemies. Enemies with their Weakness Broken in this way will trigger the Quantum Weakness Break effect.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Silver_Maze.png",
    "Talent": "Awaiting System Response...\nImpair\nSilver Wolf can create three types of Bugs: reduce ATK by 5%, reduce DEF by 4%, and reduce SPD by 3%.\nEvery time Silver Wolf attacks, she has a 60% base chance to implant a random Bug that lasts for 3 turn(s) in the enemy target.",
    "TalentImage": "lib/images/skills/SkillIcon_Silver_Passive.png",
    "eidolon1": "Social Engineering\nAfter using her Ultimate to attack enemies, Silver Wolf regenerates 7 Energy for every debuff that the target enemy currently has. This effect can be triggered up to 5 time(s) in each use of her Ultimate.",
    "eidolon1Image": "lib/images/edions/Silver Wolf_Rank_1.png",
    "eidolon2": "Zombie Network\nWhen an enemy enters battle, reduces their Effect RES by 20%.",
    "eidolon2Image": "lib/images/edions/Silver Wolf_Rank_2.png",
    "eidolon3": "Payload\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Silver Wolf_Rank_3.png",
    "eidolon4": "Bounce Attack\nAfter using her Ultimate to attack enemies, deals Additional Quantum DMG equal to 20% of Silver Wolf's ATK for every debuff currently on the enemy target. This effect can be triggered for a maximum of 5 time(s) during each use of her Ultimate.",
    "eidolon4Image": "lib/images/edions/Silver Wolf_Rank_4.png",
    "eidolon5": "Brute Force Attack\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Silver Wolf_Rank_5.png",
    "eidolon6": "Overlay Network\nFor every debuff the target enemy has, the DMG dealt by Silver Wolf increases by 20%, up to a limit of 100%.",
    "eidolon6Image": "lib/images/edions/Silver Wolf_Rank_6.png",
    "ascension2": "Generate\nBug's duration is extended for 1 turn(s). Every time an enemy is inflicted with Weakness Break, Silver Wolf has a 65% base chance of implanting a random Bug in the enemy.",
    "ascension2Image": "lib/images/skills/SkillIcon_Silver_Rank1.png",
    "ascension4": "Inject\nThe duration of the Weakness implanted by Silver Wolf's Skill increases by 1 turn(s).",
    "ascension4Image": "lib/images/skills/SkillIcon_Silver_Rank2.png",
    "ascension6": "Side Note\nIf there are 3 or more debuff(s) affecting the enemy when the Skill is used, then the Skill decreases the enemy's All-Type RES by an additional 3%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Silver_BP.png"
  },
  {
    "name": "Sparkle",
    "path": "Quantum",
    "imagePath": "lib/images/characters/Sparkle.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Monodrama\nSingle Target\nDeals Quantum DMG equal to 50% of Sparkle's ATK to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Hanabi_Normal.png",
    "skill": "Dreamdiver\nSupport\nIncreases the CRIT DMG of a single ally by 12% of Sparkle's CRIT DMG plus 27%, lasting for 1 turn(s). And at the same time, Advances Forward this ally's action by 50%.\nWhen Sparkle uses this ability on herself, the Action Advance effect will not trigger.",
    "skillImage": "lib/images/skills/SkillIcon_Hanabi_BP.png",
    "ultimate": "The Hero with a Thousand Faces\nSupport\nRecovers 4 Skill Points for the team and grants all allies Cipher. When allies with Cipher trigger the DMG Boost effect provided by Sparkle's Talent, each stack additionally increases its effect by 6%, lasting for 2 turns.",
    "ultimateImage": "lib/images/skills/SkillIcon_Hanabi_Ultra_on.png",
    "Technique": "Unreliable Narrator\nSupport\nUsing the Technique grants all allies Misdirect for 20 seconds. Characters with Misdirect will not be detected by enemies, and entering battle in the Misdirect state recovers 3 Skill Point(s) for the team.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Hanabi_Maze.png",
    "Talent": "Red Herring\nSupport\nWhile Sparkle is on the battlefield, additionally increases the max number of Skill Points by 2. Whenever an ally consumes 1 Skill Point, all allies' DMG increases by 3%. This effect lasts for 2 turn(s) and can stack up to 3 time(s).",
    "TalentImage": "lib/images/skills/SkillIcon_Hanabi_Passive.png",
    "eidolon1": "Suspension of Disbelief\nThe Cipher effect applied by the Ultimate lasts for 1 extra turn. All allies affected by Cipher have their ATK increased by 40%.",
    "eidolon1Image": "lib/images/edions/Hanabi_Rank_1.png",
    "eidolon2": "Purely Fictitious\nEach Talent stack allows allies to ignore 8% of the enemy target's DEF when dealing DMG to enemies.",
    "eidolon2Image": "lib/images/edions/Hanabi_Rank_1.png",
    "eidolon3": "Pipedream\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Hanabi_Rank_1.png",
    "eidolon4": "Life Is a Gamble\nThe Ultimate recovers 1 more Skill Point. The Talent additionally increases Max Skill Points by 1.",
    "eidolon4Image": "lib/images/edions/Hanabi_Rank_1.png",
    "eidolon5": "Parallax Truth\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Hanabi_Rank_1.png",
    "eidolon6": "Narrative Polysemy\nThe CRIT DMG Boost effect of Sparkle's Skill additionally increases by 30% of Sparkle's CRIT DMG, and when she uses her Skill, the CRIT DMG Boost effect will apply to all allies currently with Cipher. When Sparkle uses her Ultimate, this effect will spread to all allies with Cipher should the allied target have the CRIT DMG increase effect provided by the Skill active on them.",
    "eidolon6Image": "lib/images/edions/Hanabi_Rank_1.png",
    "ascension2": "Almanac\nWhen using Basic ATK, additionally regenerates 10 Energy.",
    "ascension2Image": "lib/images/skills/SkillIcon_Hanabi_SkillTree1.png",
    "ascension4": "Artificial Flower\nThe CRIT DMG Boost effect provided by the Skill will extend to last until the start of the target's next turn.",
    "ascension4Image": "lib/images/skills/SkillIcon_Hanabi_SkillTree2.png",
    "ascension6": "Nocturne\nIncreases all allies' ATK by 15%. When there are 1/2/3 Quantum allies in your team, increases Quantum-Type allies' ATK by 5%/15%/30%.",
    "ascension6Image": "lib/images/skills/SkillIcon_Hanabi_SkillTree3.png"
  },
  {
    "name": "Sushang",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Sushang.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Cloudfencer Art: Starshine\nSingle Target\nDeals Physical DMG equal to 50% of Sushang's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1206_Normal.png",
    "skill": "Cloudfencer Art: Mountainfall\nSingle Target\nDeals Physical DMG equal to 105% of Sushang's ATK to a single enemy.\nIn addition, there is a 33% chance to trigger Sword Stance on the final hit, dealing additional Physical DMG equal to 50% of Sushang's ATK to the enemy.\nIf the enemy is inflicted with Weakness Break, Sword Stance is guaranteed to trigger.",
    "skillImage": "lib/images/skills/SkillIcon_1206_BP.png",
    "ultimate": "Shape of Taixu: Dawn Herald\nSingle Target\nDeals Physical DMG equal to 192% of Sushang's ATK to a single enemy and immediately Advances Forward her actions by 100%.\nIn addition, Sushang's ATK increases by 18% and using her Skill has 2 additional chances to trigger Sword Stance for 2 turn(s).\nSword Stance triggered from the extra chances deals 50% of the original DMG.",
    "ultimateImage": "lib/images/skills/SkillIcon_1206_Ultra_on.png",
    "Technique": "Cloudfencer Art: Warcry\nImmediately attacks the enemy.\nUpon entering battle, Sushang deals Physical DMG equal to 80% of her ATK to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1206_Maze.png",
    "Talent": "Dancing Blade\nSupport\nWhen an enemy has their Weakness Broken on the field, Sushang's SPD increases by 15.00% for 2 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_1206_Passive.png",
    "eidolon1": "Cut With Ease\nAfter using the Skill against a Weakness Broken enemy, regenerates 1 Skill Point",
    "eidolon1Image": "lib/images/edions/Sushang_Rank_1.png",
    "eidolon2": "Refine in Toil\nAfter triggering Sword Stance, the DMG taken by Sushang is reduced by 20% for 1 turn.",
    "eidolon2Image": "lib/images/edions/Sushang_Rank_2.png",
    "eidolon3": "Rise From Fame\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/Sushang_Rank_3.png",
    "eidolon4": "Cleave With Heart\nSushang's Break Effect increases by 40%.",
    "eidolon4Image": "lib/images/edions/Sushang_Rank_4.png",
    "eidolon5": "Prevail via Taixu\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/Sushang_Rank_5.png",
    "eidolon6": "Guileless\nWhen current HP percentage is 50% or lower, reduces the chance of being attacked by enemies.",
    "eidolon6Image": "lib/images/edions/Sushang_Rank_6.png",
    "ascension2": "Guileless\nWhen current HP percentage is 50% or lower, reduces the chance of being attacked by enemies.",
    "ascension2Image": "lib/images/skills/SkillIcon_1206_Rank6.png",
    "ascension4": "Riposte\nFor every Sword Stance triggered, the DMG dealt by Sword Stance increases by 2.5%. Stacks up to 10 time(s)",
    "ascension4Image": "lib/images/skills/SkillIcon_1206_Rank1.png",
    "ascension6": "Vanquisher\nAfter using Basic ATK or Skill, if there are enemies on the field with Weakness Break, Sushang's action is Advanced Forward by 15%.",
    "ascension6Image": "lib/images/skills/SkillIcon_1206_Rank2.png"
  },
  {
    "name": "Tingyun",
    "path": "Harmony",
    "imagePath": "lib/images/characters/Tingyun.png",
    "element": "Lightning",
    "elementImage": "lib/images/thunder.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Dislodged\nSingle Target\nDeals Lightning DMG equal to 50% of Tingyun's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1202_Normal.png",
    "skill": "Soothing Melody\nSupport\nGrants a single ally with Benediction to increase their ATK by 25%, up to 15% of Tingyun's current ATK.\nWhen the ally with Benediction attacks, they will deal Additional Lightning DMG equal to 20% of that ally's ATK for 1 time.\nBenediction lasts for 3 turn(s) and is only effective on the most recent receiver of Tingyun's Skill.",
    "skillImage": "lib/images/skills/SkillIcon_1202_BP.png",
    "ultimate": "Amidst the Rejoicing Clouds\nSupport\nRegenerates 50 Energy for a single ally and increases the target's DMG by 20% for 2 turn(s).",
    "ultimateImage": "lib/images/skills/SkillIcon_1202_Ultra_on.png",
    "Technique": "Gentle Breeze\nSupport\nTingyun immediately regenerates 50 Energy upon using her Technique.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1202_Maze.png",
    "Talent": "Violet Sparknado\nEnhance\nWhen an enemy is attacked by Tingyun, the ally with Benediction immediately deals Additional Lightning DMG equal to 30% of that ally's ATK to the same enemy.",
    "TalentImage": "lib/images/skills/SkillIcon_1202_Passive.png",
    "eidolon1": "Windfall of Lucky Springs\nAfter using their Ultimate, the ally with Benediction gains a 20% increase in SPD for 1 turn.",
    "eidolon1Image": "lib/images/edions/Tingyun_Rank_1.png",
    "eidolon2": "Gainfully Gives, Givingly Gains\nThe ally with Benediction regenerates 5 Energy after defeating an enemy. This effect can only be triggered once per turn.",
    "eidolon2Image": "lib/images/edions/Tingyun_Rank_2.png",
    "eidolon3": "Halcyon Bequest\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Tingyun_Rank_3.png",
    "eidolon4": "Jovial Versatility\nThe DMG multiplier provided by Benediction increases by 20%.",
    "eidolon4Image": "lib/images/edions/Tingyun_Rank_4.png",
    "eidolon5": "Sauntering Coquette\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Tingyun_Rank_5.pngg",
    "eidolon6": "Peace Brings Wealth to All\nUltimate regenerates 10 more Energy for the target ally.",
    "eidolon6Image": "lib/images/edions/Tingyun_Rank_6.png",
    "ascension2": "Nourished Joviality\nTingyun's SPD increases by 20% for 1 turn after using Skill.",
    "ascension2Image": "lib/images/skills/SkillIcon_1202_Rank1.png",
    "ascension4": "Knell Subdual\nIncreases Basic ATK DMG by 40%.",
    "ascension4Image": "lib/images/skills/SkillIcon_1202_Rank2.png",
    "ascension6": "Jubilant Passage\nTingyun immediately regenerates 5 Energy at the start of her turn.",
    "ascension6Image": "lib/images/skills/SkillIcon_1202_Ultra.png"
  },
  {
    "name": "Topaz & Numby",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Topaz and Numby.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Deficit...\nSingle Target\nDeals Fire DMG equal to 50% of Topaz's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Topaz and Numby_Normal.png",
    "skill": "Difficulty Paying?\nSingle Target\nInflicts a single target enemy with a Proof of Debt status, increasing the DMG it takes from follow-up attacks by 25%. Proof of Debt only takes effect on the most recent target it is applied to. If there are no enemies inflicted with Proof of Debt on the field when an ally's turn starts or when an ally takes action, Topaz will inflict a random enemy with Proof of Debt.\nNumby deals Fire DMG equal to 75% of Topaz's ATK to this target. Using this Skill to deal DMG is considered as launching a follow-up attack.",
    "skillImage": "lib/images/skills/SkillIcon_Topaz and Numby_BP.png",
    "ultimate": "Turn a Profit!\nEnhance\nNumby enters the Windfall Bonanza! state and its DMG multiplier increases by 75% and CRIT DMG increases by 12.5%. Also, when enemies with Proof of Debt are hit by an ally's Basic ATK, Skill, or Ultimate, Numby's action is Advanced Forward by 50%. Numby exits the Windfall Bonanza! state after using 2 attacks.",
    "ultimateImage": "lib/images/skills/SkillIcon_Topaz and Numby_Ultra_on.png",
    "Technique": "Explicit Subsidy\nEnhance\nSummons Numby when Topaz enters the overworld. Numby will automatically search for Basic Treasures and Trotters within a set radius.\nUsing her Technique will regenerate 60 Energy for Topaz after Numby's first attack in the next battle.\nIf Topaz is still in the team after using her Technique and defeating overworld enemies, a small bonus amount of credits will be added to the earned credits. A maximum of 10000 bonus credits can be received per calendar day.\nAfter using her Technique and defeating enemies in Simulated Universe, additionally receive a small amount of Cosmic Fragments with a small chance to obtain 1 random Curio.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Topaz and Numby_Maze.png",
    "Talent": "Trotter Market!?\nSingle Target\nSummons Numby at the start of battle. Numby has 80 SPD by default. When taking action, Numby launches follow-up attacks on a single enemy target afflicted with Proof of Debt, dealing Fire DMG equal to 75% of Topaz's ATK.\nWhen enemies afflicted with Proof of Debt receive an ally's follow-up attacks, Numby's action is Advanced Forward by 50%. The action Advance Forward effect cannot be triggered during Numby's own turn.\nWhen Topaz is downed, Numby disappears.",
    "TalentImage": "lib/images/skills/SkillIcon_Topaz and Numby_Passive.png",
    "eidolon1": "Future Market\nWhen enemies afflicted with Proof of Debt receive follow-up attacks, they will enter the Debtor state. This can take effect only once within a single action.\nThe Debtor state increases the CRIT DMG of follow-up attacks inflicted on the target enemies by 25%, stacking up to 2 time(s). When Proof of Debt is removed, the Debtor state is also removed.",
    "eidolon1Image": "lib/images/edions/Topaz and Numby_Rank_1.png",
    "eidolon2": "Bona Fide Acquisition\nAfter Numby takes action and launches an attack, Topaz regenerates 5 Energy.",
    "eidolon2Image": "lib/images/edions/Topaz and Numby_Rank_2.png",
    "eidolon3": "Seize the Big and Free the Small\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10",
    "eidolon3Image": "lib/images/edions/Topaz and Numby_Rank_3.png",
    "eidolon4": "Agile Operation\nAfter Numby's turn begins, Topaz's action is Advanced Forward by 20%.",
    "eidolon4Image": "lib/images/edions/Topaz and Numby_Rank_4.png",
    "eidolon5": "Inflationary Demand\nUltimate Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Topaz and Numby_Rank_5.png",
    "eidolon6": "Incentive Mechanism\nNumby's attack count during the Windfall Bonanza! state increases by 1, and its Fire RES PEN increases by 10% when it attacks.",
    "eidolon6Image": "lib/images/edions/Topaz and Numby_Rank_6.png",
    "ascension2": "Overdraft\nWhen Topaz uses Basic ATK to deal DMG, it will be considered as a follow-up attack.",
    "ascension2Image": "lib/images/skills/SkillIcon_Topaz and Numby_SkillTree1.png",
    "ascension4": "Financial Turmoil\nIncreases Topaz and Numby's DMG dealt to enemy targets with Fire Weakness by 15%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Topaz and Numby_SkillTree2.png",
    "ascension6": "Stonks Market\nAfter Numby uses an attack while in the Windfall Bonanza! state, Topaz additionally regenerates 10 Energy.",
    "ascension6Image": "lib/images/skills/SkillIcon_Topaz and Numby_SkillTree3.png"
  },
  {
    "name": "Trailblazer(Fire)",
    "path": "Preservation",
    "imagePath": "lib/images/characters/Main_Preservation.png",
    "element": "Fire",
    "elementImage": "lib/images/fire.png",
    "pathImage": "lib/images/per.png",
    "basic": "Ice-Breaking Light\nSingle Target\nSingle Target\nDeals Fire DMG equal to 50% of the Trailblazer's ATK to a single enemy and gains 1 stack of Magma Will.\n\nBlast\nConsumes 4 stacks of Magma Will to enhance Basic ATK, dealing Fire DMG equal to 90% of the Trailblazer's ATK to a single enemy and Fire DMG to equal to 36% of the Trailblazer's ATK to enemies adjacent to it.",
    "basicImage": "lib/images/skills/SkillIcon_8003_Normal.png",
    "skill": "Ever-Burning Amber\nDefense\nIncreases the Trailblazer's DMG Reduction by 40% and gains 1 stack of Magma Will, with a 100% base chance to Taunt all enemies for 1 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_8003_BP.png",
    "ultimate": "War-Flaming Lance\nAoE ATK\nDeals Fire DMG equal to 50% of the Trailblazer's ATK plus 75% of the Trailblazer's DEF to all enemies.\nThe next Basic ATK will be automatically enhanced and does not cost Magma Will.",
    "ultimateImage": "lib/images/skills/SkillIcon_8003_Ultra_on.png",
    "Technique": "Call of the Guardian\nDefense\nAfter using Technique, at the start of the next battle, gains a Shield that absorbs DMG equal to 30% of the Trailblazer's DEF plus 384 for 1 turn(s).",
    "TechniqueImage": "lib/images/skills/SkillIcon_8003_Maze.png",
    "Talent": "Treasure of the Architects\nEnhance\nEach time the Trailblazer is hit, they gain 1 stack of Magma Will for a max of 8 stack(s).\nWhen Magma Will has no fewer than 4 stacks, the Trailblazer's Basic ATK becomes enhanced, dealing DMG to a single enemy and enemies adjacent to it.\nWhen the Trailblazer uses Basic ATK, Skill, or Ultimate, apply a Shield to all allies that absorbs DMG equal to 4% of the Trailblazer's DEF plus 20.\nThe Shield lasts for 2 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_8003_Passive.png",
    "eidolon1": "Earth-Shaking Resonance\nWhen the Trailblazer uses their Basic ATK, additionally deals Fire DMG equal to 25% of the Trailblazer's DEF.\nWhen the Trailblazer uses their enhanced Basic ATK, additionally deals Fire DMG equal to 50% of the Trailblazer's DEF.",
    "eidolon1Image": "lib/images/edions/e1.png",
    "eidolon2": "Time-Defying Tenacity\nThe Shield applied to all allies from the Trailblazer's Talent will block extra DMG equal to 2% of the Trailblazer's DEF plus 27.",
    "eidolon2Image": "lib/images/edions/e2.png",
    "eidolon3": "Trail-Blazing Blueprint\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/e3.png",
    "eidolon4": "Nation-Building Oath\nAt the start of the battle, immediately gains 4 stack(s) of Magma Will.",
    "eidolon4Image": "lib/images/edions/e4.png",
    "eidolon5": "Spirit-Warming Flame\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/e5.png",
    "eidolon6": "City-Forging Bulwarks\nAfter the Trailblazer use enhanced Basic ATK or Ultimate, their DEF increases by 10%.\nStacks up to 3 time(s).",
    "eidolon6Image": "lib/images/edions/e6.png",
    "ascension2": "The Strong Defends the Weak\nAfter using the Skill, the DMG taken by all allies reduces by 15% for 1 turn(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_8003_Rank1.png",
    "ascension4": "Unwavering Gallantry\nUsing Enhanced Basic ATK restores the Trailblazer's HP by 5% of their Max HP.",
    "ascension4Image": "lib/images/skills/SkillIcon_8003_Rank2.png",
    "ascension6": "Action Beats Overthinking\nWhen the Trailblazer is protected by a Shield at the beginning of the turn, increases their ATK by 15% and regenerates 5 Energy until the action is over.",
    "ascension6Image": "lib/images/skills/SkillIcon_8003_Ultra.png"
  },
  {
    "name": "Trailblazer(Physical)",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Main_Destruction.png",
    "element": "Physical",
    "elementImage": "lib/images/physical.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Farewell Hit\nSingle Target\nDeals Physical DMG equal to 50% of the Trailblazer's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_8001_Normal.png",
    "skill": "RIP Home Run\nBlast\nDeals Physical DMG equal to 62% of the Trailblazer's ATK to a single enemy and any adjacent enemies.",
    "skillImage": "lib/images/skills/SkillIcon_8001_BP.png",
    "ultimate": "Stardust Ace\nEnhance\nChoose between two attack modes to deliver a full strike.\nBlowout: Farewell Hit deals Physical DMG equal to 300% of the Trailblazer's ATK to a single enemy.\nBlowout: RIP Home Run deals Physical DMG equal to 180% of the Trailblazer's ATK to a single enemy and Physical DMG equal to 108% of the Trailblazer's ATK to adjacent enemies.",
    "ultimateImage": "lib/images/skills/SkillIcon_8001_Ultra_on.png",
    "Technique": "Immortal Third Strike\nRestore\nImmediately heals all allies for 15% of their respective Max HP after using this Technique.",
    "TechniqueImage": "lib/images/skills/SkillIcon_8001_Maze.png",
    "Talent": "Perfect Pickoff\nEnhance\nEach time this character inflicts Weakness Break on an enemy, ATK increases by 10%.\nThis effect stacks up to 2 time(s).",
    "TalentImage": "lib/images/skills/SkillIcon_8001_Passive.png",
    "eidolon1": "A Falling Star\nWhen enemies are defeated due to the Trailblazer's Ultimate, the Trailblazer regenerates 10 extra Energy. This effect can only be triggered once per attack.",
    "eidolon1Image": "lib/images/edions/se1.png",
    "eidolon2": "An Unwilling Host\nAttacking enemies with Physical Weakness restores the Trailblazer's HP equal to 5% of the Trailblazer's ATK.",
    "eidolon2Image": "lib/images/edions/se2.png",
    "eidolon3": "A Leading Whisper\nSkill Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon3Image": "lib/images/edions/se3.png",
    "eidolon4": "A Destructing Glance\nWhen attacking an enemy with Weakness Break, CRIT Rate is increased by 25%.",
    "eidolon4Image": "lib/images/edions/se4.png",
    "eidolon5": "A Surviving Hope\nUltimate Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon5Image": "lib/images/edions/se5.png",
    "eidolon6": "A Trailblazing Will\nThe Trailblazer's Talent is also triggered when they defeat an enemy.",
    "eidolon6Image": "lib/images/edions/se6.png",
    "ascension2": "Ready for Battle\nAt the start of the battle, immediately regenerates 15 Energy.",
    "ascension2Image": "lib/images/skills/SkillIcon_8001_Rank1.png",
    "ascension4": "Perseverance\nEach Talent stack increases the Trailblazer's DEF by 10%.",
    "ascension4Image": "lib/images/skills/SkillIcon_8001_Rank2.png",
    "ascension6": "Fighting Will\nWhen using Skill or Ultimate \"Blowout: RIP Home Run\", DMG dealt to the target enemy is increased by 25%.",
    "ascension6Image": "lib/images/skills/SkillIcon_8001_BP.png"
  },
  {
    "name": "Welt",
    "path": "Nihility",
    "imagePath": "lib/images/characters/Welt.png",
    "element": "Imaginary",
    "elementImage": "lib/images/imaginary.png",
    "pathImage": "lib/images/nil.png",
    "basic": "Gravity Suppression\nSingle Target\nDeals Imaginary DMG equal to 50% of Welt's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Welt_Normal.png",
    "skill": "Edge of the Void\nBounce\nDeals Imaginary DMG equal to 36% of Welt's ATK to a single enemy and further deals DMG 2 extra times, with each time dealing Imaginary DMG equal to 36% of Welt's ATK to a random enemy.\nOn hit, there is a 65% base chance to reduce the enemy's SPD by 10% for 2 turn(s).",
    "skillImage": "lib/images/skills/SkillIcon_Welt_BP.png",
    "ultimate": "Synthetic Black Hole\nAoE ATK\nDeals Imaginary DMG equal to 90% of Welt's ATK to all enemies, with a 100% base chance for enemies hit by this ability to be Imprisoned for 1 turn.\nImprisoned enemies have their actions delayed by 32% and SPD reduced by 10%.",
    "ultimateImage": "lib/images/skills/SkillIcon_Welt_Ultra_on.png",
    "Technique": "Gravitational Imprisonment\nImpair\nAfter using Welt's Technique, create a dimension that lasts for 15 second(s).\nEnemies in this dimension have their Movement SPD reduced by 50%.\nAfter entering battle with enemies in the dimension, there is a 100% base chance to Imprison the enemies for 1 turn.\nImprisoned enemies have their actions delayed by 20% and SPD reduced by 10%.\nOnly 1 dimension created by allies can exist at the same time.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Welt_Maze.png",
    "Talent": "Time Distortion\nEnhance\nWhen hitting an enemy that is already Slowed, Welt deals Additional Imaginary DMG equal to 30% of his ATK to the enemy.",
    "TalentImage": "lib/images/skills/SkillIcon_Welt_Passive.png",
    "eidolon1": "Legacy of Honor\nAfter Welt uses his Ultimate, his abilities are enhanced.\nThe next 2 time(s) he uses his Basic ATK or Skill, deals Additional DMG to the target equal to 50% of his Basic ATK's DMG multiplier or 80% of his Skill's DMG multiplier respectively.",
    "eidolon1Image": "lib/images/edions/Welt_Rank_1.png",
    "eidolon2": "Conflux of Stars\nWhen his Talent is triggered, Welt regenerates 3 Energy.",
    "eidolon2Image": "lib/images/edions/Welt_Rank_2.png",
    "eidolon3": "Prayer of Peace\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Welt_Rank_3.png",
    "eidolon4": "Appellation of Justice\nBase chance for Skill to inflict SPD Reduction increases by 35%.",
    "eidolon4Image": "lib/images/edions/Welt_Rank_4.png",
    "eidolon5": "Power of Kindness\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Welt_Rank_5.png",
    "eidolon6": "Prospect of Glory\nWhen using Skill, deals DMG for 1 extra time to a random enemy.",
    "eidolon6Image": "lib/images/edions/Welt_Rank_6.png",
    "ascension2": "Retribution\nWhen using Ultimate, there is a 100% base chance to increase the DMG received by the targets by 12% for 2 turn(s).",
    "ascension2Image": "lib/images/skills/SkillIcon_Welt_Rank1.png",
    "ascension4": "Judgment\nUsing Ultimate additionally regenerates 10 Energy.",
    "ascension4Image": "lib/images/skills/SkillIcon_Welt_Rank2.png",
    "ascension6": "Punishment\nDeals 20% more DMG to enemies inflicted with Weakness Break.",
    "ascension6Image": "lib/images/skills/SkillIcon_Welt_Ultra.png"
  },
  {
    "name": "Xueyi",
    "path": "Destruction",
    "imagePath": "lib/images/characters/Xueyi.png",
    "element": "Quantum",
    "elementImage": "lib/images/quantum.png",
    "pathImage": "lib/images/dest.png",
    "basic": "Mara-Sunder Awl\nSingle Target\nDeals 50% of Xueyi's ATK as Quantum DMG to a single target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Xueyi_Normal.png",
    "skill": "Iniquity Obliteration\nBlast\nDeals Quantum DMG equal to 70% of Xueyi's ATK to a single enemy, and Quantum DMG equal to 35% of Xueyi's ATK to any adjacent enemies.",
    "skillImage": "lib/images/skills/SkillIcon_Xueyi_BP.png",
    "ultimate": "Divine Castigation\nSingle Target\nDeals Quantum DMG equal to 150% of Xueyi's ATK to a single target enemy. This attack ignores Weakness Types and reduces the enemy's Toughness. When the enemy's Weakness is Broken, the Quantum Weakness Break effect is triggered.\nIn this attack, the more Toughness is reduced, the higher the DMG will be dealt, up to a max of 36% increase.",
    "ultimateImage": "lib/images/skills/SkillIcon_Xueyi_Ultra_on.png",
    "Technique": "Summary Execution\nBreak\nImmediately attacks the enemy. After entering combat, deals 80% of Xueyi's ATK as Quantum DMG to all enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Xueyi_Maze.png",
    "Talent": "Karmic Perpetuation\nBounce\nWhen Xueyi reduces enemy Toughness with attacks, Karma will be stacked. The more Toughness is reduced, the more stacks of Karma are added, up to 8 stacks.\nWhen Xueyi's allies reduce enemy Toughness with attacks, Xueyi gains 1 stacks of Karma.\nWhen Karma reaches the max number of stacks, consumes all current Karma stacks and immediately launches a follow-up attack against an enemy target, dealing DMG for 3 times, with each time dealing Quantum DMG equal to 45% of Xueyi's ATK to a single random enemy. This follow-up attack will not add Karma stacks.",
    "TalentImage": "lib/images/skills/SkillIcon_Xueyi_Passive.png",
    "eidolon1": "Dvesha, Inhibited\nIncreases the DMG dealt by the Talent's follow-up attack by 40%.",
    "eidolon1Image": "lib/images/edions/Xueyi_Rank_1.png",
    "eidolon2": "Klesha, Breached\nTalent's follow-up attack reduces enemy Toughness regardless of Weakness types. At the same time, restores Xueyi's HP by an amount equal to 5% of her Max HP. When breaking Weakness, triggers the Quantum Break Effect.",
    "eidolon2Image": "lib/images/edions/Xueyi_Rank_2.png",
    "eidolon3": "Duḥkha, Ceased\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Xueyi_Rank_3.png",
    "eidolon4": "Karma, Severed\nWhen using Ultimate, increases Break Effect by 40% for 2 turn(s).",
    "eidolon4Image": "lib/images/edions/Xueyi_Rank_4.png",
    "eidolon5": "Deva, Enthralled\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Xueyi_Rank_5.png",
    "eidolon6": "Saṃsāra, Mastered\nThe max stack limit for Karma decreases to 6.",
    "eidolon6Image": "lib/images/edions/Xueyi_Rank_6.png",
    "ascension2": "Clairvoyant Loom\nIncreases DMG dealt by this unit by an amount equal to 100% of Break Effect, up to a maximum DMG increase of 240%.",
    "ascension2Image": "lib/images/skills/SkillIcon_Xueyi_SkillTree1.png",
    "ascension4": "Intrepid Rollerbearings\nIf the enemy target's Toughness is equal to or higher than 50% of their Max Toughness, deals 10% more DMG when using Ultimate.",
    "ascension4Image": "lib/images/skills/SkillIcon_Xueyi_SkillTree2.png",
    "ascension6": "Perspicacious Mainframe\nXueyi will keep a tally of the number of Karma stacks that exceed the max stack limit, up to 6 stacks in the tally. After Xueyi's Talent is triggered, she will gain a corresponding number of tallied Karma stacks.",
    "ascension6Image": "lib/images/skills/SkillIcon_Xueyi_SkillTree3.png"
  },
  {
    "name": "Yangqing",
    "path": "Hunt",
    "imagePath": "lib/images/characters/Yanqing.png",
    "element": "Ice",
    "elementImage": "lib/images/ice.png",
    "pathImage": "lib/images/hunt.png",
    "basic": "Frost Thorn\nSingle Target\nDeals Ice DMG equal to 50% of Yanqing's ATK to a single enemy.",
    "basicImage": "lib/images/skills/SkillIcon_Yanqing_Normal.png",
    "skill": "Darting Ironthorn\nSingle Target\nDeals Ice DMG equal to 110% of Yanqing's ATK to a single enemy and activates Soulsteel Sync for 1 turn.",
    "skillImage": "lib/images/skills/SkillIcon_Yanqing_BP.png",
    "ultimate": "Amidst the Raining Bliss\nSingle Target\nIncreases Yanqing's CRIT Rate by 60%. When Soulsteel Sync is active, increases Yanqing's CRIT DMG by an extra 30% for one turn. Afterwards, deals Ice DMG equal to 210% of Yanqing's ATK to a single enemy.",
    "ultimateImage": "lib/images/skills/SkillIcon_Yanqing_Ultra_on.png",
    "Technique": "The One True Sword\nEnhance\nAfter using his Technique, at the start of the next battle, Yanqing deals 30% more DMG for 2 turn(s) to enemies whose current HP is 50% or higher.",
    "TechniqueImage": "lib/images/skills/SkillIcon_Yanqing_Maze.png",
    "Talent": "One With the Sword\nSingle Target\nWhen Soulsteel Sync is active, Yanqing is less likely to be attacked by enemies.\nYanqing's CRIT Rate increases by 15% and his CRIT DMG increases by 15%.\nAfter Yanqing attacks an enemy, there is a 50% fixed chance to perform a follow-up attack, dealing Ice DMG equal to 25% of Yanqing's ATK to the enemy, which has a 65% base chance to Freeze the enemy for 1 turn.\nThe Frozen target cannot take actions and receives Additional Ice DMG equal to 25% of Yanqing's ATK at the beginning of each turn.\nWhen Yanqing received DMG, the Soulsteel Sync effect will dissapear.",
    "TalentImage": "lib/images/skills/SkillIcon_Yanqing_Passive.png",
    "eidolon1": "Svelte Saber\nWhen Yanqing attacks a Frozen enemy, he deals Additional Ice DMG equal to 60% of his ATK.",
    "eidolon1Image": "lib/images/edions/Yanqing_Rank_1.png",
    "eidolon2": "Supine Serenade\nWhen Soulsteel Sync is active, Energy Regeneration Rate increases by an extra 10%.",
    "eidolon2Image": "lib/images/edions/Yanqing_Rank_2.png",
    "eidolon3": "Sword Savant\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Yanqing_Rank_3.png",
    "eidolon4": "Searing Sting\nWhen the current HP percentage is 80% or higher, Ice RES PEN increases by 12%.",
    "eidolon4Image": "lib/images/edions/Yanqing_Rank_4.png",
    "eidolon5": "Surging Strife\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Yanqing_Rank_5.png",
    "eidolon6": "Swift Swoop\nIf the Ultimate's buffs are still in effect when an enemy is defeated, their duration is extended by 1 turn.",
    "eidolon6Image": "lib/images/edions/Yanqing_Rank_6.png",
    "ascension2": "cing on the Kick\nWhen Yanqing attacks, deals Additional Ice DMG equal to 30% of Yanqin's ATK to targets with Ice Weakness.",
    "ascension2Image": "lib/images/skills/SkillIcon_Yanqing_SkillTree1.png",
    "ascension4": "Frost Favors the Brave\nWhen Soulsteel Sync is active, Effect RES increases by 20%.",
    "ascension4Image": "lib/images/skills/SkillIcon_Yanqing_SkillTree2.png",
    "ascension6": "Gentle Blade\nWhen a CRIT Hit is triggered, increases SPD by 10% for 2 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_Yanqing_SkillTree3.png"
  },
  {
    "name": "Yukong",
    "path": "Harmony",
    "imagePath": "lib/images/characters/Yukong.png",
    "element": "Imaginary",
    "elementImage": "lib/images/imaginary.png",
    "pathImage": "lib/images/harm.png",
    "basic": "Arrowslinger\nSingle Target\nDeals 50% of Yukong's ATK as Imaginary DMG to a target enemy.",
    "basicImage": "lib/images/skills/SkillIcon_1207_Normal.png",
    "skill": "Emboldening Salvo\nSupport\nObtains 2 stack(s) of \"Roaring Bowstrings\" (to a maximum of 2 stacks). When \"Roaring Bowstrings\" is active, the ATK of all allies increases by 40%, and every time an ally's turn ends, Yukong loses 1 stack of \"Roaring Bowstrings.\"\nWhen it's the turn where Yukong gains \"Roaring Bowstrings\" by using Skill, \"Roaring Bowstrings\" will not be removed.",
    "skillImage": "lib/images/skills/SkillIcon_1207_BP.png",
    "ultimate": "Diving Kestrel\nSingle Target\nIf \"Roaring Bowstrings\" is active on Yukong when her Ultimate is used, additionally increases all allies' CRIT Rate by 21% and CRIT DMG by 39%. At the same time, deals Imaginary DMG equal to 228% of Yukong's ATK to a single enemy.",
    "ultimateImage": "lib/images/skills/SkillIcon_1207_Ultra_on.png",
    "Technique": "Chasing the Wind\nEnhance\nAfter using her Technique, Yukong enters Sprint mode for 20 seconds. In Sprint mode, her Movement SPD increases by 35%, and Yukong gains 2 stack(s) of \"Roaring Bowstrings\" when she enters battle by attacking enemies.",
    "TechniqueImage": "lib/images/skills/SkillIcon_1207_Maze.png",
    "Talent": "Seven Layers, One Arrow\nEnhance\nBasic ATK additionally deals Imaginary DMG equal to 40% of Yukong's ATK, and increases the Toughness-Reducing DMG of this attack by 100%. This effect can be triggered again in 1 turn(s).",
    "TalentImage": "lib/images/skills/SkillIcon_1207_Passive.png",
    "eidolon1": "Aerial Marshal\nAt the start of battle, increases the SPD of all allies by 10% for 2 turn(s).",
    "eidolon1Image": "lib/images/edions/Yukong_Rank_1.png",
    "eidolon2": "Skyward Command\nWhen any ally's current energy is equal to its energy limit, Yukong regenerates an additional 5 energy. This effect can only be triggered once for each ally. The trigger count is reset after Yukong casts her Ultimate.",
    "eidolon2Image": "lib/images/edions/Yukong_Rank_2.png",
    "eidolon3": "Torrential Fusillade\nSkill Lv. +2, up to a maximum of Lv. 15.\nBasic ATK Lv. +1, up to a maximum of Lv. 10.",
    "eidolon3Image": "lib/images/edions/Yukong_Rank_3.png",
    "eidolon4": "Zephyrean Echoes\nWhen \"Roaring Bowstrings\" is active, Yukong deals 30% more DMG to enemies.",
    "eidolon4Image": "lib/images/edions/Yukong_Rank_4.png",
    "eidolon5": "August Deadshot\nUltimate Lv. +2, up to a maximum of Lv. 15.\nTalent ATK Lv. +2, up to a maximum of Lv. 15.",
    "eidolon5Image": "lib/images/edions/Yukong_Rank_5.png",
    "eidolon6": "Bowstring Thunderclap\nWhen Yukong uses her Ultimate, she immediately gains 1 stack(s) of \"Roaring Bowstrings.\"",
    "eidolon6Image": "lib/images/edions/Yukong_Rank_6.png",
    "ascension2": "Bowmaster\nWhen Yukong is on the field, Imaginary DMG dealt by all allies increases by 12%.",
    "ascension2Image": "lib/images/skills/SkillIcon_1207_Rank1.png",
    "ascension4": "Majestas\nWhen \"Roaring Bowstrings\" is active, Yukong regenerates 2 additional Energy every time an ally takes action.",
    "ascension4Image": "lib/images/skills/SkillIcon_1207_Rank2.png",
    "ascension6": "Archerion\nYukong can resist 1 debuff application for 1 time. This effect can be triggered again in 2 turn(s).",
    "ascension6Image": "lib/images/skills/SkillIcon_1207_Ultra.png"
  }
]